var weapon_list = [
    { "id": 11101, "name": "Тупой меч", "level": 1 },
    { "id": 11201, "name": "Серебряный меч", "level": 2 },
    { "id": 11301, "name": "Холодное лезвие", "level": 3 },
    { "id": 11302, "name": "Предвестник зари", "level": 3 },
    { "id": 11303, "name": "Меч путешественника", "level": 3 },
    { "id": 11304, "name": "Тёмный железный меч", "level": 3 },
    { "id": 11305, "name": "Филейный нож", "level": 3 },
    { "id": 11306, "name": "Меч небесного всадника", "level": 3 },
    { "id": 11401, "name": "Меч Фавония", "level": 4 },
    { "id": 11402, "name": "Меч-флейта", "level": 4 },
    { "id": 11403, "name": "Церемониальный меч", "level": 4 },
    { "id": 11404, "name": "Меч аристократов", "level": 4 },
    { "id": 11405, "name": "Драконий рык", "level": 4 },
    { "id": 11406, "name": "Прототип: Злоба", "level": 4 },
    { "id": 11407, "name": "Стальное жало", "level": 4 },
    { "id": 11408, "name": "Черногорский длинный меч", "level": 4 },
    { "id": 11409, "name": "Чёрный меч", "level": 4 },
    { "id": 11410, "name": "Вспышка во тьме", "level": 4 },
    { "id": 11412, "name": "Меч нисхождения", "level": 4 },
    { "id": 11413, "name": "Осквернённое желание", "level": 4 },
    { "id": 11414, "name": "Амэнома Кагэути", "level": 4 },
    { "id": 11415, "name": "Киноварное веретено", "level": 4 },
    { "id": 11501, "name": "Меч Сокола", "level": 5 },
    { "id": 11502, "name": "Небесный меч", "level": 5 },
    { "id": 11503, "name": "Клятва свободы", "level": 5 },
    { "id": 11504, "name": "Кромсатель пиков", "level": 5 },
    { "id": 11505, "name": "Драгоценный омут", "level": 5 },
    { "id": 11509, "name": "Рассекающий туман", "level": 5 },
    { "id": 11510, "name": "Харан гэппаку фуцу", "level": 5 },
    { "id": 12101, "name": "Двуручный меч богатыря", "level": 1 },
    { "id": 12201, "name": "Лучший друг наёмника", "level": 2 },
    { "id": 12301, "name": "Металлическая тень", "level": 3 },
    { "id": 12302, "name": "Меч драконьей крови", "level": 3 },
    { "id": 12303, "name": "Меч из белого железа", "level": 3 },
    { "id": 12304, "name": "Кварц (CBT2)", "level": 3 },
    { "id": 12305, "name": "Дубина переговоров", "level": 3 },
    { "id": 12306, "name": "Большой меч небесного всадника", "level": 3 },
    { "id": 12401, "name": "Двуручный меч Фавония", "level": 4 },
    { "id": 12402, "name": "Меч-колокол", "level": 4 },
    { "id": 12403, "name": "Церемониальный двуручный меч", "level": 4 },
    { "id": 12404, "name": "Королевский двуручный меч", "level": 4 },
    { "id": 12405, "name": "Дождерез", "level": 4 },
    { "id": 12406, "name": "Прототип: Архаичный", "level": 4 },
    { "id": 12407, "name": "Белая тень", "level": 4 },
    { "id": 12408, "name": "Черногорская бритва", "level": 4 },
    { "id": 12409, "name": "Меч драконьей кости", "level": 4 },
    { "id": 12410, "name": "Каменный меч", "level": 4 },
    { "id": 12411, "name": "Заснеженное звёздное серебро", "level": 4 },
    { "id": 12412, "name": "Благодатный владыка вод", "level": 4 },
    { "id": 12414, "name": "Кацурагикири Нагамаса", "level": 4 },
    { "id": 12416, "name": "Акуомару", "level": 4 },
    { "id": 12501, "name": "Небесное величие", "level": 5 },
    { "id": 12502, "name": "Волчья погибель", "level": 5 },
    { "id": 12503, "name": "Песнь разбитых сосен", "level": 5 },
    { "id": 12504, "name": "Некованый", "level": 5 },
    { "id": 12510, "name": "Краснорогий камнеруб", "level": 5 },
    { "id": 13101, "name": "Копьё новичка", "level": 1 },
    { "id": 13201, "name": "Железный наконечник", "level": 2 },
    { "id": 13301, "name": "Белая кисть", "level": 3 },
    { "id": 13302, "name": "Алебарда Миллелита", "level": 3 },
    { "id": 13303, "name": "Чёрная кисть", "level": 3 },
    { "id": 13304, "name": "Флагшток", "level": 3 },
    { "id": 13401, "name": "Гроза драконов", "level": 4 },
    { "id": 13402, "name": "Прототип: Звёздный блеск", "level": 4 },
    { "id": 13403, "name": "Пика полумесяца", "level": 4 },
    { "id": 13404, "name": "Черногорская пика", "level": 4 },
    { "id": 13405, "name": "Смертельный бой", "level": 4 },
    { "id": 13406, "name": "Каменное копьё", "level": 4 },
    { "id": 13407, "name": "Копьё Фавония", "level": 4 },
    { "id": 13408, "name": "Королевское копьё", "level": 4 },
    { "id": 13409, "name": "Копьё Драконьего хребта", "level": 4 },
    { "id": 13414, "name": "Крест-копьё Китаин", "level": 4 },
    { "id": 13415, "name": "\"Улов\"", "level": 4 },
    { "id": 13416, "name": "Режущий волны плавник", "level": 4 },
    { "id": 13501, "name": "Посох Хомы", "level": 5 },
    { "id": 13502, "name": "Небесная ось", "level": 5 },
    { "id": 13504, "name": "Покоритель вихря", "level": 5 },
    { "id": 13505, "name": "Нефритовый коршун", "level": 5 },
    { "id": 13507, "name": "Усмиритель бед", "level": 5 },
    { "id": 13509, "name": "Сияющая жатва", "level": 5 },
    { "id": 14101, "name": "Записи ученика", "level": 1 },
    { "id": 14201, "name": "Карманный гримуар", "level": 2 },
    { "id": 14301, "name": "Руководство по магии", "level": 3 },
    { "id": 14302, "name": "Эпос о драконоборцах", "level": 3 },
    { "id": 14303, "name": "Потусторонняя история", "level": 3 },
    { "id": 14304, "name": "Изумрудный шар", "level": 3 },
    { "id": 14305, "name": "Парный нефрит", "level": 3 },
    { "id": 14306, "name": "Янтарная жемчужина (CBT3)", "level": 3 },
    { "id": 14401, "name": "Кодекс Фавония", "level": 4 },
    { "id": 14402, "name": "Песнь странника", "level": 4 },
    { "id": 14403, "name": "Церемониальные мемуары", "level": 4 },
    { "id": 14404, "name": "Королевский гримуар", "level": 4 },
    { "id": 14405, "name": "Солнечная жемчужина", "level": 4 },
    { "id": 14406, "name": "Прототип: Янтарь", "level": 4 },
    { "id": 14407, "name": "Морской атлас", "level": 4 },
    { "id": 14408, "name": "Черногорский агат", "level": 4 },
    { "id": 14409, "name": "Око сознания", "level": 4 },
    { "id": 14410, "name": "Вино и песни", "level": 4 },
    { "id": 14412, "name": "Плод вечной мерзлоты", "level": 4 },
    { "id": 14413, "name": "Истории Додоко", "level": 4 },
    { "id": 14414, "name": "Кольцо Хакусин", "level": 4 },
    { "id": 14415, "name": "Око клятвы", "level": 4 },
    { "id": 14501, "name": "Небесный атлас", "level": 5 },
    { "id": 14502, "name": "Молитва святым ветрам", "level": 5 },
    { "id": 14504, "name": "Память о пыли", "level": 5 },
    { "id": 14506, "name": "Вечное лунное сияние", "level": 5 },
    { "id": 14509, "name": "Истина кагура", "level": 5 },
    { "id": 15101, "name": "Лук охотника", "level": 1 },
    { "id": 15201, "name": "Лук опытного охотника", "level": 2 },
    { "id": 15301, "name": "Лук ворона", "level": 3 },
    { "id": 15302, "name": "Клятва стрелка", "level": 3 },
    { "id": 15303, "name": "Изогнутый лук", "level": 3 },
    { "id": 15304, "name": "Рогатка", "level": 3 },
    { "id": 15305, "name": "Посыльный", "level": 3 },
    { "id": 15306, "name": "Эбеновый лук", "level": 3 },
    { "id": 15401, "name": "Боевой лук Фавония", "level": 4 },
    { "id": 15402, "name": "Бесструнный", "level": 4 },
    { "id": 15403, "name": "Церемониальный лук", "level": 4 },
    { "id": 15404, "name": "Королевский лук", "level": 4 },
    { "id": 15405, "name": "Ржавый лук", "level": 4 },
    { "id": 15406, "name": "Прототип: Полумесяц", "level": 4 },
    { "id": 15407, "name": "Составной лук", "level": 4 },
    { "id": 15408, "name": "Черногорский боевой лук", "level": 4 },
    { "id": 15409, "name": "Зелёный лук", "level": 4 },
    { "id": 15410, "name": "Охотник во тьме", "level": 4 },
    { "id": 15412, "name": "Вальс Нирваны Ночи", "level": 4 },
    { "id": 15413, "name": "Ода анемонии", "level": 4 },
    { "id": 15414, "name": "Хамаюми", "level": 4 },
    { "id": 15415, "name": "Хищник", "level": 4 },
    { "id": 15416, "name": "Луна Моун", "level": 4 },
    { "id": 15501, "name": "Небесное крыло", "level": 5 },
    { "id": 15502, "name": "Лук Амоса' Bow", "level": 5 },
    { "id": 15503, "name": "Элегия погибели", "level": 5 },
    { "id": 15507, "name": "Полярная звезда", "level": 5 },
    { "id": 15509, "name": "Громовой пульс", "level": 5 },
    { "id": 20001, "name": "", "level": 5 },
    { "id": 10002, "name": "", "level": 1 },
    { "id": 10003, "name": "", "level": 1 },
    { "id": 10004, "name": "", "level": 1 },
    { "id": 10005, "name": "", "level": 1 },
    { "id": 10006, "name": "", "level": 1 },
    { "id": 10008, "name": "", "level": 1 }
];


var avatar_list = [
    { "id": 10000001, "name": "Катя?!?", "element": "Electric" },
    { "id": 10000002, "name": "Комисато Аяка", "element": "Ice" },
    { "id": 10000003, "name": "Джинн", "element": "Wind" },
    { "id": 10000006, "name": "Лиза", "element": "Electric" },
    { "id": 10000014, "name": "Барбара", "element": "Water" },
    { "id": 10000015, "name": "Кейя", "element": "Ice" },
    { "id": 10000016, "name": "Дилюк", "element": "Fire" },
    { "id": 10000020, "name": "Рейзор", "element": "Electric" },
    { "id": 10000021, "name": "Эмбер", "element": "Fire" },
    { "id": 10000022, "name": "Венти", "element": "Wind" },
    { "id": 10000023, "name": "Сян Лин", "element": "Fire" },
    { "id": 10000024, "name": "Бейдоу", "element": "Electric" },
    { "id": 10000025, "name": "Син Цю", "element": "Water" },
    { "id": 10000026, "name": "Сяо", "element": "Wind" },
    { "id": 10000027, "name": "Нин Гуан", "element": "Rock" },
    { "id": 10000029, "name": "Кли", "element": "Fire" },
    { "id": 10000030, "name": "Джун Ли", "element": "Rock" },
    { "id": 10000031, "name": "Фишль", "element": "Electric" },
    { "id": 10000032, "name": "Беннет", "element": "Fire" },
    { "id": 10000033, "name": "Тарталья", "element": "Water" },
    { "id": 10000034, "name": "Ноэлль", "element": "Rock" },
    { "id": 10000035, "name": "Чича", "element": "Ice" },
    { "id": 10000036, "name": "Чунь Юнь", "element": "Ice" },
    { "id": 10000037, "name": "Гань Юй", "element": "Ice" },
    { "id": 10000038, "name": "Альбедо", "element": "Rock" },
    { "id": 10000039, "name": "Диона", "element": "Ice" },
    { "id": 10000041, "name": "Мона", "element": "Water" },
    { "id": 10000042, "name": "Ке Цин", "element": "Electric" },
    { "id": 10000043, "name": "Сахароза", "element": "Wind" },
    { "id": 10000044, "name": "Синь Янь", "element": "Fire" },
    { "id": 10000045, "name": "Розария", "element": "Ice" },
    { "id": 10000046, "name": "Ху Тао", "element": "Fire" },
    { "id": 10000047, "name": "Каэдахара Кадзуха", "element": "Wind" },
    { "id": 10000048, "name": "Янь Фей", "element": "Fire" },
    { "id": 10000049, "name": "Ёимия", "element": "Fire" },
    { "id": 10000050, "name": "Тома", "element": "Fire" },
    { "id": 10000051, "name": "Эола", "element": "Ice" },
    { "id": 10000052, "name": "Райден Сёгун", "element": "Electric" },
    { "id": 10000053, "name": "Саю", "element": "Wind" },
    { "id": 10000054, "name": "Сангономия Кокоми", "element": "Water" },
    { "id": 10000055, "name": "Горо", "element": "Rock" },
    { "id": 10000056, "name": "Кудзё Сара", "element": "Electric" },
    { "id": 10000057, "name": "Аратаки Итто", "element": "Rock" },
    { "id": 10000058, "name": "Яэ Мико", "element": "Electric" },
    { "id": 10000062, "name": "Элой", "element": "Ice" },
    { "id": 10000063, "name": "Шень Хэ", "element": "Ice" },
    { "id": 10000064, "name": "Юнь Цзинь", "element": "Rock" },
    { "id": 10000066, "name": "Комисато Аято", "element": "Water" }
]


var reli_list = [{
        "id": 10001,
        "name": "Решимость временщика",
        "contains": {
            "3": [
                { "id": 51310, "name": "Кубок временщика", "main": 5000, "append": 301 },
                { "id": 51320, "name": "Перо возвращения домой", "main": 2000, "append": 301 },
                { "id": 51330, "name": "Венок расставания", "main": 3000, "append": 301 },
                { "id": 51340, "name": "Сердце товарищества", "main": 4000, "append": 301 },
                { "id": 51350, "name": "Солнечные часы временщика", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 51410, "name": "Кубок временщика", "main": 5000, "append": 401 },
                { "id": 51420, "name": "Перо возвращения домой", "main": 2000, "append": 401 },
                { "id": 51430, "name": "Венок расставания", "main": 3000, "append": 401 },
                { "id": 51440, "name": "Сердце товарищества", "main": 4000, "append": 401 },
                { "id": 51450, "name": "Солнечные часы временщика", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10002,
        "name": "Душа храбреца",
        "contains": {
            "3": [
                { "id": 52310, "name": "Проводы храбреца", "main": 5000, "append": 301 },
                { "id": 52320, "name": "Надежды храбреца", "main": 2000, "append": 301 },
                { "id": 52330, "name": "Венок храбреца", "main": 3000, "append": 301 },
                { "id": 52340, "name": "Брошь храбреца", "main": 4000, "append": 301 },
                { "id": 52350, "name": "Стойкость храбреца", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 52410, "name": "Проводы храбреца", "main": 5000, "append": 401 },
                { "id": 52420, "name": "Надежды храбреца", "main": 2000, "append": 401 },
                { "id": 52430, "name": "Венок храбреца", "main": 3000, "append": 401 },
                { "id": 52440, "name": "Брошь храбреца", "main": 4000, "append": 401 },
                { "id": 52450, "name": "Стойкость храбреца", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10003,
        "name": "Воля защитника",
        "contains": {
            "3": [
                { "id": 53310, "name": "Фляжка защитника", "main": 5000, "append": 301 },
                { "id": 53320, "name": "Перо защитника", "main": 2000, "append": 301 },
                { "id": 53330, "name": "Повязка защитника", "main": 3000, "append": 301 },
                { "id": 53340, "name": "Цветок защитника", "main": 4000, "append": 301 },
                { "id": 53350, "name": "Часы защитника", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 53410, "name": "Фляжка защитника", "main": 5000, "append": 401 },
                { "id": 53420, "name": "Перо защитника", "main": 2000, "append": 401 },
                { "id": 53430, "name": "Повязка защитника", "main": 3000, "append": 401 },
                { "id": 53440, "name": "Цветок защитника", "main": 4000, "append": 401 },
                { "id": 53450, "name": "Часы защитника", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10004,
        "name": "Маленькое чудо",
        "contains": {
            "3": [
                { "id": 54310, "name": "Чашка маленького чуда", "main": 5000, "append": 301 },
                { "id": 54320, "name": "Перо маленького чуда", "main": 2000, "append": 301 },
                { "id": 54330, "name": "Серёжки маленького чуда", "main": 3000, "append": 301 },
                { "id": 54340, "name": "Цветок маленького чуда", "main": 4000, "append": 301 },
                { "id": 54350, "name": "Песочные часы маленького чуда", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 54410, "name": "Чашка маленького чуда", "main": 5000, "append": 401 },
                { "id": 54420, "name": "Перо маленького чуда", "main": 2000, "append": 401 },
                { "id": 54430, "name": "Серёжки маленького чуда", "main": 3000, "append": 401 },
                { "id": 54440, "name": "Цветок маленького чуда", "main": 4000, "append": 401 },
                { "id": 54450, "name": "Песочные часы маленького чуда", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10005,
        "name": "Берсерк",
        "contains": {
            "3": [
                { "id": 55310, "name": "Костяной кубок берсерка", "main": 5000, "append": 301 },
                { "id": 55320, "name": "Перо берсерка", "main": 2000, "append": 301 },
                { "id": 55330, "name": "Боевая маска берсерка", "main": 3000, "append": 301 },
                { "id": 55340, "name": "Роза берсерка", "main": 4000, "append": 301 },
                { "id": 55350, "name": "Часы берсерка", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 55410, "name": "Костяной кубок берсерка", "main": 5000, "append": 401 },
                { "id": 55420, "name": "Перо берсерка", "main": 2000, "append": 401 },
                { "id": 55430, "name": "Боевая маска берсерка", "main": 3000, "append": 401 },
                { "id": 55440, "name": "Роза берсерка", "main": 4000, "append": 401 },
                { "id": 55450, "name": "Часы берсерка", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10006,
        "name": "Воин",
        "contains": {
            "3": [
                { "id": 56310, "name": "Винный бокал воина", "main": 5000, "append": 301 },
                { "id": 56320, "name": "Перо воина", "main": 2000, "append": 301 },
                { "id": 56330, "name": "Повязка воина", "main": 3000, "append": 301 },
                { "id": 56340, "name": "Алый цветок воина", "main": 4000, "append": 301 },
                { "id": 56350, "name": "Водяные часы воина", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 56410, "name": "Винный бокал воина", "main": 5000, "append": 401 },
                { "id": 56420, "name": "Перо воина", "main": 2000, "append": 401 },
                { "id": 56430, "name": "Повязка воина", "main": 3000, "append": 401 },
                { "id": 56440, "name": "Алый цветок воина", "main": 4000, "append": 401 },
                { "id": 56450, "name": "Водяные часы воина", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10007,
        "name": "Инструктор",
        "contains": {
            "3": [
                { "id": 57310, "name": "Чайная кружка инструктора", "main": 5000, "append": 301 },
                { "id": 57320, "name": "Перо инструктора", "main": 2000, "append": 301 },
                { "id": 57330, "name": "Кепка инструктора", "main": 3000, "append": 301 },
                { "id": 57340, "name": "Брошь инструктора", "main": 4000, "append": 301 },
                { "id": 57350, "name": "Карманные часы инструктора", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 57410, "name": "Чайная кружка инструктора", "main": 5000, "append": 401 },
                { "id": 57420, "name": "Перо инструктора", "main": 2000, "append": 401 },
                { "id": 57430, "name": "Кепка инструктора", "main": 3000, "append": 401 },
                { "id": 57440, "name": "Брошь инструктора", "main": 4000, "append": 401 },
                { "id": 57450, "name": "Карманные часы инструктора", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10008,
        "name": "Азартный игрок",
        "contains": {
            "3": [
                { "id": 58310, "name": "Стакан для костей азартного игрока", "main": 5000, "append": 301 },
                { "id": 58320, "name": "Перо азартного игрока", "main": 2000, "append": 301 },
                { "id": 58330, "name": "Серёжки азартного игрока", "main": 3000, "append": 301 },
                { "id": 58340, "name": "Брошь азартного игрока", "main": 4000, "append": 301 },
                { "id": 58350, "name": "Карманные часы азартного игрока", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 58410, "name": "Стакан для костей азартного игрока", "main": 5000, "append": 401 },
                { "id": 58420, "name": "Перо азартного игрока", "main": 2000, "append": 401 },
                { "id": 58430, "name": "Серёжки азартного игрока", "main": 3000, "append": 401 },
                { "id": 58440, "name": "Брошь азартного игрока", "main": 4000, "append": 401 },
                { "id": 58450, "name": "Карманные часы азартного игрока", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10009,
        "name": "Изгнанник",
        "contains": {
            "3": [
                { "id": 59310, "name": "Кубок изгнанника", "main": 5000, "append": 301 },
                { "id": 59320, "name": "Перо изгнанника", "main": 2000, "append": 301 },
                { "id": 59330, "name": "Корона изгнанника", "main": 3000, "append": 301 },
                { "id": 59340, "name": "Цветок изгнанника", "main": 4000, "append": 301 },
                { "id": 59350, "name": "Карманные часы изгнанника", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 59410, "name": "Кубок изгнанника", "main": 5000, "append": 401 },
                { "id": 59420, "name": "Перо изгнанника", "main": 2000, "append": 401 },
                { "id": 59430, "name": "Корона изгнанника", "main": 3000, "append": 401 },
                { "id": 59440, "name": "Цветок изгнанника", "main": 4000, "append": 401 },
                { "id": 59450, "name": "Карманные часы изгнанника", "main": 1000, "append": 401 }
            ]
        }
    },

    {
        "id": 10010,
        "name": "Искатель приключений",
        "contains": {
            "1": [
                { "id": 60110, "name": "Кубок искателя приключений", "main": 5000, "append": 101 },
                { "id": 60120, "name": "Перо искателя приключений", "main": 2000, "append": 101 },
                { "id": 60130, "name": "Повязка искателя приключений", "main": 3000, "append": 101 },
                { "id": 60140, "name": "Цветок искателя приключений", "main": 4000, "append": 101 },
                { "id": 60150, "name": "Часы искателя приключений", "main": 1000, "append": 101 }
            ],
            "2": [
                { "id": 60210, "name": "Кубок искателя приключений", "main": 5000, "append": 201 },
                { "id": 60220, "name": "Перо искателя приключений", "main": 2000, "append": 201 },
                { "id": 60230, "name": "Повязка искателя приключений", "main": 3000, "append": 201 },
                { "id": 60240, "name": "Цветок искателя приключений", "main": 4000, "append": 201 },
                { "id": 60250, "name": "Часы искателя приключений", "main": 1000, "append": 201 }
            ],
            "3": [
                { "id": 60310, "name": "Кубок искателя приключений", "main": 5000, "append": 301 },
                { "id": 60320, "name": "Перо искателя приключений", "main": 2000, "append": 301 },
                { "id": 60330, "name": "Повязка искателя приключений", "main": 3000, "append": 301 },
                { "id": 60340, "name": "Цветок искателя приключений", "main": 4000, "append": 301 },
                { "id": 60350, "name": "Часы искателя приключений", "main": 1000, "append": 301 }
            ]
        }
    },

    {
        "id": 10011,
        "name": "Везунчик",
        "contains": {
            "1": [
                { "id": 61110, "name": "Кубок везунчика", "main": 5000, "append": 101 },
                { "id": 61120, "name": "Орлиное перо везунчика", "main": 2000, "append": 101 },
                { "id": 61130, "name": "Серебряная корона везунчика", "main": 3000, "append": 101 },
                { "id": 61140, "name": "Клевер везунчика", "main": 4000, "append": 101 },
                { "id": 61150, "name": "Песочные часы везунчика", "main": 1000, "append": 101 }
            ],
            "2": [
                { "id": 61210, "name": "Кубок везунчика", "main": 5000, "append": 201 },
                { "id": 61220, "name": "Орлиное перо везунчика", "main": 2000, "append": 201 },
                { "id": 61230, "name": "Серебряная корона везунчика", "main": 3000, "append": 201 },
                { "id": 61240, "name": "Клевер везунчика", "main": 4000, "append": 201 },
                { "id": 61250, "name": "Песочные часы везунчика", "main": 1000, "append": 201 }
            ],
            "3": [
                { "id": 61310, "name": "Кубок везунчика", "main": 5000, "append": 301 },
                { "id": 61320, "name": "Орлиное перо везунчика", "main": 2000, "append": 301 },
                { "id": 61330, "name": "Серебряная корона везунчика", "main": 3000, "append": 301 },
                { "id": 61340, "name": "Клевер везунчика", "main": 4000, "append": 301 },
                { "id": 61350, "name": "Песочные часы везунчика", "main": 1000, "append": 301 }
            ]
        }
    },
    {
        "id": 10012,
        "name": "Учёный",
        "contains": {
            "3": [
                { "id": 62310, "name": "Чернильница учёного", "main": 5000, "append": 301 },
                { "id": 62320, "name": "Перо учёного", "main": 2000, "append": 301 },
                { "id": 62330, "name": "Очки учёного", "main": 3000, "append": 301 },
                { "id": 62340, "name": "Закладка учёного", "main": 4000, "append": 301 },
                { "id": 62350, "name": "Часы учёного", "main": 1000, "append": 301 }
            ],
            "4": [
                { "id": 62410, "name": "Чернильница учёного", "main": 5000, "append": 401 },
                { "id": 62420, "name": "Перо учёного", "main": 2000, "append": 401 },
                { "id": 62430, "name": "Очки учёного", "main": 3000, "append": 401 },
                { "id": 62440, "name": "Закладка учёного", "main": 4000, "append": 401 },
                { "id": 62450, "name": "Часы учёного", "main": 1000, "append": 401 }
            ]
        }
    },
    {
        "id": 10013,
        "name": "Целитель",
        "contains": {
            "1": [
                { "id": 63110, "name": "Чайничек целителя", "main": 5000, "append": 101 },
                { "id": 63120, "name": "Совиное перо целителя", "main": 2000, "append": 101 },
                { "id": 63130, "name": "Платок целителя", "main": 3000, "append": 101 },
                { "id": 63140, "name": "Серебряный лотос целителя", "main": 4000, "append": 101 },
                { "id": 63150, "name": "Карманные часы целителя", "main": 1000, "append": 101 }
            ],
            "2": [
                { "id": 63210, "name": "Чайничек целителя", "main": 5000, "append": 201 },
                { "id": 63220, "name": "Совиное перо целителя", "main": 2000, "append": 201 },
                { "id": 63230, "name": "Платок целителя", "main": 3000, "append": 201 },
                { "id": 63240, "name": "Серебряный лотос целителя", "main": 4000, "append": 201 },
                { "id": 63250, "name": "Карманные часы целителя", "main": 1000, "append": 201 }
            ],
            "3": [
                { "id": 63310, "name": "Чайничек целителя", "main": 5000, "append": 301 },
                { "id": 63320, "name": "Совиное перо целителя", "main": 2000, "append": 301 },
                { "id": 63330, "name": "Платок целителя", "main": 3000, "append": 301 },
                { "id": 63340, "name": "Серебряный лотос целителя", "main": 4000, "append": 301 },
                { "id": 63350, "name": "Карманные часы целителя", "main": 1000, "append": 301 }
            ]
        }
    },
    {
        "id": 14001,
        "name": "Заблудший в метели",
        "contains": {
            "4": [
                { "id": 71410, "name": "Морозная гордость", "main": 5000, "append": 401 },
                { "id": 71420, "name": "Решимость крушителя льда", "main": 2000, "append": 401 },
                { "id": 71430, "name": "Эхо осколков инея", "main": 3000, "append": 401 },
                { "id": 71440, "name": "Занесённая снегом память", "main": 4000, "append": 401 },
                { "id": 71450, "name": "Гибель замёрзшей родины", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 71510, "name": "Морозная гордость", "main": 5000, "append": 501 },
                { "id": 71520, "name": "Решимость крушителя льда", "main": 2000, "append": 501 },
                { "id": 71530, "name": "Эхо осколков инея", "main": 3000, "append": 501 },
                { "id": 71540, "name": "Занесённая снегом память", "main": 4000, "append": 501 },
                { "id": 71550, "name": "Гибель замёрзшей родины", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 14002,
        "name": "Усмиряющий гром",
        "contains": {
            "4": [
                { "id": 72410, "name": "Бокал усмиряющего гром", "main": 5000, "append": 401 },
                { "id": 72420, "name": "Перо усмиряющего гром", "main": 2000, "append": 401 },
                { "id": 72430, "name": "Корона усмиряющего гром", "main": 3000, "append": 401 },
                { "id": 72440, "name": "Сердце усмиряющего гром", "main": 4000, "append": 401 },
                { "id": 72450, "name": "Время усмиряющего гром", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 72510, "name": "Бокал усмиряющего гром", "main": 5000, "append": 501 },
                { "id": 72520, "name": "Перо усмиряющего гром", "main": 2000, "append": 501 },
                { "id": 72530, "name": "Корона усмиряющего гром", "main": 3000, "append": 501 },
                { "id": 72540, "name": "Сердце усмиряющего гром", "main": 4000, "append": 501 },
                { "id": 72550, "name": "Время усмиряющего гром", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 14003,
        "name": "Ступающий по лаве",
        "contains": {
            "4": [
                { "id": 73410, "name": "Просветление ступающего по лаве", "main": 5000, "append": 401 },
                { "id": 73420, "name": "Спасение ступающего по лаве", "main": 2000, "append": 401 },
                { "id": 73430, "name": "Мудрость ступающего по лаве", "main": 3000, "append": 401 },
                { "id": 73440, "name": "Решительность ступающего по лаве", "main": 4000, "append": 401 },
                { "id": 73450, "name": "Муки ступающего по лаве", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 73510, "name": "Просветление ступающего по лаве", "main": 5000, "append": 501 },
                { "id": 73520, "name": "Спасение ступающего по лаве", "main": 2000, "append": 501 },
                { "id": 73530, "name": "Мудрость ступающего по лаве", "main": 3000, "append": 501 },
                { "id": 73540, "name": "Решительность ступающего по лаве", "main": 4000, "append": 501 },
                { "id": 73550, "name": "Муки ступающего по лаве", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 14004,
        "name": "Возлюбленная юная дева",
        "contains": {
            "4": [
                { "id": 74410, "name": "Досуг юной девы", "main": 5000, "append": 401 },
                { "id": 74420, "name": "Тоска юной девы", "main": 2000, "append": 401 },
                { "id": 74430, "name": "Увядающая красота юной девы", "main": 3000, "append": 401 },
                { "id": 74440, "name": "Далёкая душа юной девы", "main": 4000, "append": 401 },
                { "id": 74450, "name": "Уходящая молодость юной девы", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 74510, "name": "Досуг юной девы", "main": 5000, "append": 501 },
                { "id": 74520, "name": "Тоска юной девы", "main": 2000, "append": 501 },
                { "id": 74530, "name": "Увядающая красота юной девы", "main": 3000, "append": 501 },
                { "id": 74540, "name": "Далёкая душа юной девы", "main": 4000, "append": 501 },
                { "id": 74550, "name": "Уходящая молодость юной девы", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15001,
        "name": "Конец гладиатора",
        "contains": {
            "4": [
                { "id": 75410, "name": "Пьянство гладиатора", "main": 5000, "append": 401 },
                { "id": 75420, "name": "Судьба гладиатора", "main": 2000, "append": 401 },
                { "id": 75430, "name": "Триумф гладиатора", "main": 3000, "append": 401 },
                { "id": 75440, "name": "Ностальгия гладиатора", "main": 4000, "append": 401 },
                { "id": 75450, "name": "Стремление гладиатора", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 75510, "name": "Пьянство гладиатора", "main": 5000, "append": 501 },
                { "id": 75520, "name": "Судьба гладиатора", "main": 2000, "append": 501 },
                { "id": 75530, "name": "Триумф гладиатора", "main": 3000, "append": 501 },
                { "id": 75540, "name": "Ностальгия гладиатора", "main": 4000, "append": 501 },
                { "id": 75550, "name": "Стремление гладиатора", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15002,
        "name": "Изумрудная тень",
        "contains": {
            "4": [
                { "id": 76410, "name": "Сосуд изумрудного охотника", "main": 5000, "append": 401 },
                { "id": 76420, "name": "Оперение стрелы изумрудного охотника", "main": 2000, "append": 401 },
                { "id": 76430, "name": "Венок изумрудного охотника", "main": 3000, "append": 401 },
                { "id": 76440, "name": "Воспоминания об изумрудных лугах", "main": 4000, "append": 401 },
                { "id": 76450, "name": "Решимость изумрудного охотника", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 76510, "name": "Сосуд изумрудного охотника", "main": 5000, "append": 501 },
                { "id": 76520, "name": "Оперение стрелы изумрудного охотника", "main": 2000, "append": 501 },
                { "id": 76530, "name": "Венок изумрудного охотника", "main": 3000, "append": 501 },
                { "id": 76540, "name": "Воспоминания об изумрудных лугах", "main": 4000, "append": 501 },
                { "id": 76550, "name": "Решимость изумрудного охотника", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15003,
        "name": "Странствующий ансамбль",
        "contains": {
            "4": [
                { "id": 77410, "name": "Фляжка странника", "main": 5000, "append": 401 },
                { "id": 77420, "name": "Оперение стрелы барда", "main": 2000, "append": 401 },
                { "id": 77430, "name": "Цилиндр дирижёра", "main": 3000, "append": 401 },
                { "id": 77440, "name": "Рассвет ансамбля", "main": 4000, "append": 401 },
                { "id": 77450, "name": "Окончание концерта", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 77510, "name": "Фляжка странника", "main": 5000, "append": 501 },
                { "id": 77520, "name": "Оперение стрелы барда", "main": 2000, "append": 501 },
                { "id": 77530, "name": "Цилиндр дирижёра", "main": 3000, "append": 501 },
                { "id": 77540, "name": "Рассвет ансамбля", "main": 4000, "append": 501 },
                { "id": 77550, "name": "Окончание концерта", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15004,
        "name": "Снег и лёд",
        "contains": {
            "6": [
                { "id": 78340, "name": "Сердце зимнего леса", "main": 4000, "append": 301 },
                { "id": 78320, "name": "Перо снежных равнин", "main": 2000, "append": 301 },
                { "id": 78350, "name": "Часы песчаных льдов", "main": 1000, "append": 301 },
                { "id": 78310, "name": "Кубок северных ветров", "main": 5000, "append": 301 },
                { "id": 78330, "name": "Корона мёрзлых рек", "main": 3000, "append": 301 }
            ]
        }
    },
    {
        "id": 15005,
        "name": "Громогласный рёв ярости",
        "contains": {
            "4": [
                { "id": 79410, "name": "Предвестник бури", "main": 5000, "append": 401 },
                { "id": 79420, "name": "Переживший катастрофу", "main": 2000, "append": 401 },
                { "id": 79430, "name": "Корона призывателя грома", "main": 3000, "append": 401 },
                { "id": 79440, "name": "Милосердие буревестника", "main": 4000, "append": 401 },
                { "id": 79450, "name": "Песочные часы грома", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 79510, "name": "Предвестник бури", "main": 5000, "append": 501 },
                { "id": 79520, "name": "Переживший катастрофу", "main": 2000, "append": 501 },
                { "id": 79530, "name": "Корона призывателя грома", "main": 3000, "append": 501 },
                { "id": 79540, "name": "Милосердие буревестника", "main": 4000, "append": 501 },
                { "id": 79550, "name": "Песочные часы грома", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15006,
        "name": "Горящая алая ведьма",
        "contains": {
            "4": [
                { "id": 80410, "name": "Ведьмин последний час", "main": 5000, "append": 401 },
                { "id": 80420, "name": "Пылающее ведьмино перо", "main": 2000, "append": 401 },
                { "id": 80430, "name": "Тлеющая ведьмина шляпа", "main": 3000, "append": 401 },
                { "id": 80440, "name": "Ведьмин огненный цветок", "main": 4000, "append": 401 },
                { "id": 80450, "name": "Пламя ведьминого сердца", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 80510, "name": "Ведьмин последний час", "main": 5000, "append": 501 },
                { "id": 80520, "name": "Пылающее ведьмино перо", "main": 2000, "append": 501 },
                { "id": 80530, "name": "Тлеющая ведьмина шляпа", "main": 3000, "append": 501 },
                { "id": 80540, "name": "Ведьмин огненный цветок", "main": 4000, "append": 501 },
                { "id": 80550, "name": "Пламя ведьминого сердца", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15007,
        "name": "Церемония древней знати",
        "contains": {
            "4": [
                { "id": 81410, "name": "Королевская серебряная фляжка", "main": 5000, "append": 401 },
                { "id": 81420, "name": "Королевское перо", "main": 2000, "append": 401 },
                { "id": 81430, "name": "Королевская маска", "main": 3000, "append": 401 },
                { "id": 81440, "name": "Королевский цветок", "main": 4000, "append": 401 },
                { "id": 81450, "name": "Королевские карманные часы", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 81510, "name": "Королевская серебряная фляжка", "main": 5000, "append": 501 },
                { "id": 81520, "name": "Королевское перо", "main": 2000, "append": 501 },
                { "id": 81530, "name": "Королевская маска", "main": 3000, "append": 501 },
                { "id": 81540, "name": "Королевский цветок", "main": 4000, "append": 501 },
                { "id": 81550, "name": "Королевские карманные часы", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15008,
        "name": "Рыцарь крови",
        "contains": {
            "4": [
                { "id": 82410, "name": "Кубок рыцаря крови", "main": 5000, "append": 401 },
                { "id": 82420, "name": "Перо рыцаря крови", "main": 2000, "append": 401 },
                { "id": 82430, "name": "Железная маска рыцаря крови", "main": 3000, "append": 401 },
                { "id": 82440, "name": "Железное сердце рыцаря крови", "main": 4000, "append": 401 },
                { "id": 82450, "name": "Час долга рыцаря крови", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 82510, "name": "Кубок рыцаря крови", "main": 5000, "append": 501 },
                { "id": 82520, "name": "Перо рыцаря крови", "main": 2000, "append": 501 },
                { "id": 82530, "name": "Железная маска рыцаря крови", "main": 3000, "append": 501 },
                { "id": 82540, "name": "Железное сердце рыцаря крови", "main": 4000, "append": 501 },
                { "id": 82550, "name": "Час долга рыцаря крови", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15009,
        "name": "Шаман огня",
        "contains": {
            "3": [
                { "id": 83330, "name": "Тиара огня", "main": 3000, "append": 301 }
            ],
            "4": [
                { "id": 83430, "name": "Тиара огня", "main": 3000, "append": 401 }
            ]
        }
    },
    {
        "id": 15010,
        "name": "Prayers for Destiny",
        "contains": {
            "3": [
                { "id": 84330, "name": "Tiara of Torrents", "main": 3000, "append": 301 }
            ],
            "4": [
                { "id": 84430, "name": "Tiara of Torrents", "main": 3000, "append": 401 }
            ]
        }
    },
    {
        "id": 15011,
        "name": "Шаман молний",
        "contains": {
            "3": [
                { "id": 85330, "name": "Тиара грома", "main": 3000, "append": 301 }
            ],
            "4": [
                { "id": 85430, "name": "Тиара грома", "main": 3000, "append": 401 }
            ]
        }
    },
    {
        "id": 15012,
        "name": "Шаман ветра",
        "contains": {
            "6": [
                { "id": 86330, "name": "Тиара ветра", "main": 3000, "append": 301 }
            ]
        }
    },
    {
        "id": 15013,
        "name": "Шаман льда",
        "contains": {
            "3": [
                { "id": 87330, "name": "Тиара холода", "main": 3000, "append": 301 }
            ],
            "4": [
                { "id": 87430, "name": "Тиара холода", "main": 3000, "append": 401 }
            ]
        }
    },
    {
        "id": 15014,
        "name": "Архаичный камень",
        "contains": {
            "4": [
                { "id": 88410, "name": "Кубок из резного камня", "main": 5000, "append": 401 },
                { "id": 88420, "name": "Перо зубчатых пиков", "main": 2000, "append": 401 },
                { "id": 88430, "name": "Маска из одинокого базальта", "main": 3000, "append": 401 },
                { "id": 88440, "name": "Цветок скальных трещин", "main": 4000, "append": 401 },
                { "id": 88450, "name": "Часы из прочного нефрита", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 88510, "name": "Кубок из резного камня", "main": 5000, "append": 501 },
                { "id": 88520, "name": "Перо зубчатых пиков", "main": 2000, "append": 501 },
                { "id": 88530, "name": "Маска из одинокого базальта", "main": 3000, "append": 501 },
                { "id": 88540, "name": "Цветок скальных трещин", "main": 4000, "append": 501 },
                { "id": 88550, "name": "Часы из прочного нефрита", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15015,
        "name": "Встречная комета",
        "contains": {
            "4": [
                { "id": 89410, "name": "Шар равноденствия", "main": 5000, "append": 401 },
                { "id": 89420, "name": "Конец равноденствия", "main": 2000, "append": 401 },
                { "id": 89430, "name": "Маска равноденствия", "main": 3000, "append": 401 },
                { "id": 89440, "name": "Цветок равноденствия", "main": 4000, "append": 401 },
                { "id": 89450, "name": "Час равноденствия", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 89510, "name": "Шар равноденствия", "main": 5000, "append": 501 },
                { "id": 89520, "name": "Конец равноденствия", "main": 2000, "append": 501 },
                { "id": 89530, "name": "Маска равноденствия", "main": 3000, "append": 501 },
                { "id": 89540, "name": "Цветок равноденствия", "main": 4000, "append": 501 },
                { "id": 89550, "name": "Час равноденствия", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15016,
        "name": "Сердце глубин",
        "contains": {
            "4": [
                { "id": 90410, "name": "Кубок оглушающих глубин", "main": 5000, "append": 401 },
                { "id": 90420, "name": "Порыв ностальгии", "main": 2000, "append": 401 },
                { "id": 90430, "name": "Треуголка в пятнах вина", "main": 3000, "append": 401 },
                { "id": 90440, "name": "Позолоченная брошь", "main": 4000, "append": 401 },
                { "id": 90450, "name": "Медный компас", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 90510, "name": "Кубок оглушающих глубин", "main": 5000, "append": 501 },
                { "id": 90520, "name": "Порыв ностальгии", "main": 2000, "append": 501 },
                { "id": 90530, "name": "Треуголка в пятнах вина", "main": 3000, "append": 501 },
                { "id": 90540, "name": "Позолоченная брошь", "main": 4000, "append": 501 },
                { "id": 90550, "name": "Медный компас", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15017,
        "name": "Стойкость Миллелита",
        "contains": {
            "4": [
                { "id": 91410, "name": "Золотой кубок клятвы", "main": 5000, "append": 401 },
                { "id": 91420, "name": "Боевое перо командира", "main": 2000, "append": 401 },
                { "id": 91430, "name": "Древний шлем генерала", "main": 3000, "append": 401 },
                { "id": 91440, "name": "Цветок почестей", "main": 4000, "append": 401 },
                { "id": 91450, "name": "Золотые часы", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 91510, "name": "Золотой кубок клятвы", "main": 5000, "append": 501 },
                { "id": 91520, "name": "Боевое перо командира", "main": 2000, "append": 501 },
                { "id": 91530, "name": "Древний шлем генерала", "main": 3000, "append": 501 },
                { "id": 91540, "name": "Цветок почестей", "main": 4000, "append": 501 },
                { "id": 91550, "name": "Золотые часы", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15018,
        "name": "Бледный огонь",
        "contains": {
            "4": [
                { "id": 92410, "name": "Превосходящая чаша", "main": 5000, "append": 401 },
                { "id": 92420, "name": "Перо мудрого лекаря", "main": 2000, "append": 401 },
                { "id": 92430, "name": "Смеющаяся маска", "main": 3000, "append": 401 },
                { "id": 92440, "name": "Незапятнанный цветок", "main": 4000, "append": 401 },
                { "id": 92450, "name": "Замершее мгновение", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 92510, "name": "Превосходящая чаша", "main": 5000, "append": 501 },
                { "id": 92520, "name": "Перо мудрого лекаря", "main": 2000, "append": 501 },
                { "id": 92530, "name": "Смеющаяся маска", "main": 3000, "append": 501 },
                { "id": 92540, "name": "Незапятнанный цветок", "main": 4000, "append": 501 },
                { "id": 92550, "name": "Замершее мгновение", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15019,
        "name": "Воспоминания Симэнавы",
        "contains": {
            "4": [
                { "id": 93413, "name": "Полное надежд сердце", "main": 5000, "append": 401 },
                { "id": 93423, "name": "Стрела воспоминаний", "main": 2000, "append": 401 },
                { "id": 93433, "name": "Непостоянный лик", "main": 3000, "append": 401 },
                { "id": 93443, "name": "Опутывающий цветок", "main": 4000, "append": 401 },
                { "id": 93453, "name": "Мгновение росы", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 93513, "name": "Полное надежд сердце", "main": 5000, "append": 501 },
                { "id": 93523, "name": "Стрела воспоминаний", "main": 2000, "append": 501 },
                { "id": 93533, "name": "Непостоянный лик", "main": 3000, "append": 501 },
                { "id": 93543, "name": "Опутывающий цветок", "main": 4000, "append": 501 },
                { "id": 93553, "name": "Мгновение росы", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15020,
        "name": "Эмблема рассечённой судьбы",
        "contains": {
            "4": [
                { "id": 94413, "name": "Алый сосуд", "main": 5000, "append": 401 },
                { "id": 94423, "name": "Обрезанное перо", "main": 2000, "append": 401 },
                { "id": 94433, "name": "Украшенный кабуто", "main": 3000, "append": 401 },
                { "id": 94443, "name": "Великолепная цуба", "main": 4000, "append": 401 },
                { "id": 94453, "name": "Клетка грозовых облаков", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 94513, "name": "Алый сосуд", "main": 5000, "append": 501 },
                { "id": 94523, "name": "Обрезанное перо", "main": 2000, "append": 501 },
                { "id": 94533, "name": "Украшенный кабуто", "main": 3000, "append": 501 },
                { "id": 94543, "name": "Великолепная цуба", "main": 4000, "append": 501 },
                { "id": 94553, "name": "Клетка грозовых облаков", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15021,
        "name": "Кокон сладких грёз",
        "contains": {
            "4": [
                { "id": 95413, "name": "Тыква пробуждения", "main": 5000, "append": 401 },
                { "id": 95423, "name": "Перо чертога", "main": 2000, "append": 401 },
                { "id": 95433, "name": "Шляпа телесности", "main": 3000, "append": 401 },
                { "id": 95443, "name": "Пора расцвета", "main": 4000, "append": 401 },
                { "id": 95453, "name": "Песнь жизни", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 95513, "name": "Тыква пробуждения", "main": 5000, "append": 501 },
                { "id": 95523, "name": "Перо чертога", "main": 2000, "append": 501 },
                { "id": 95533, "name": "Шляпа телесности", "main": 3000, "append": 501 },
                { "id": 95543, "name": "Пора расцвета", "main": 4000, "append": 501 },
                { "id": 95553, "name": "Песнь жизни", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15022,
        "name": "Моллюск морских красок",
        "contains": {
            "4": [
                { "id": 96413, "name": "Жемчужная клетка", "main": 5000, "append": 401 },
                { "id": 96423, "name": "Перо глубинного дворца", "main": 2000, "append": 401 },
                { "id": 96433, "name": "Корона Ватацуми", "main": 3000, "append": 401 },
                { "id": 96443, "name": "Цветок морских красок", "main": 4000, "append": 401 },
                { "id": 96453, "name": "Раковина разлуки", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 96513, "name": "Жемчужная клетка", "main": 5000, "append": 501 },
                { "id": 96523, "name": "Перо глубинного дворца", "main": 2000, "append": 501 },
                { "id": 96533, "name": "Корона Ватацуми", "main": 3000, "append": 501 },
                { "id": 96543, "name": "Цветок морских красок", "main": 4000, "append": 501 },
                { "id": 96553, "name": "Раковина разлуки", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15023,
        "name": "Киноварное загробье",
        "contains": {
            "4": [
                { "id": 97413, "name": "Мгновение договора", "main": 5000, "append": 401 },
                { "id": 97423, "name": "Солнечная реликвия", "main": 2000, "append": 401 },
                { "id": 97433, "name": "Громогласный облик", "main": 3000, "append": 401 },
                { "id": 97443, "name": "Цветение жизни", "main": 4000, "append": 401 },
                { "id": 97453, "name": "Перо скрытого сияния", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 97513, "name": "Мгновение договора", "main": 5000, "append": 501 },
                { "id": 97523, "name": "Солнечная реликвия", "main": 2000, "append": 501 },
                { "id": 97533, "name": "Громогласный облик", "main": 3000, "append": 501 },
                { "id": 97543, "name": "Цветение жизни", "main": 4000, "append": 501 },
                { "id": 97553, "name": "Перо скрытого сияния", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15024,
        "name": "Отголоски подношения",
        "contains": {
            "4": [
                { "id": 98413, "name": "Чаша истока", "main": 5000, "append": 401 },
                { "id": 98423, "name": "Символ подношения", "main": 2000, "append": 401 },
                { "id": 98433, "name": "Серьги текучести", "main": 3000, "append": 401 },
                { "id": 98443, "name": "Цветок призрачного аромата", "main": 4000, "append": 401 },
                { "id": 98453, "name": "Нефритовый листок", "main": 1000, "append": 401 }
            ],
            "5": [
                { "id": 98513, "name": "Чаша истока", "main": 5000, "append": 501 },
                { "id": 98523, "name": "Символ подношения", "main": 2000, "append": 501 },
                { "id": 98533, "name": "Серьги текучести", "main": 3000, "append": 501 },
                { "id": 98543, "name": "Цветок призрачного аромата", "main": 4000, "append": 501 },
                { "id": 98553, "name": "Нефритовый листок", "main": 1000, "append": 501 }
            ]
        }
    },
    {
        "id": 15000,
        name: "Хозяин ветров",
        "contains": {
            "6": [
                { "id": 99340, "name": "Цветок хозяина ветров", "main": 4000, "append": 301 },
                { "id": 99320, "name": "Перо хозяина ветров", "main": 2000, "append": 301 },
                { "id": 99350, "name": "Часы хозяина ветров", "main": 1000, "append": 301 },
                { "id": 99310, "name": "Чаша хозяина ветров", "main": 5000, "append": 301 },
                { "id": 99330, "name": "Корона хозяина ветров", "main": 3000, "append": 301 }
            ]
        }
    }
]


var reli_main_prop = {
    "1000": {
        "HP": { "normal": 10001, "percent": 10002 },
        "Сила атаки": { "normal": 10003, "percent": 10004 },
        "Защита": { "normal": 10005, "percent": 10006 },
        "Восстановление энергии": { "normal": 10007 },
        "Мастерство стихий": { "normal": 10008 },
        "Пиро сопротивление": { "normal": 10009 },
        "Электро сопротивление": { "normal": 10010 },
        "Крио сопротивление": { "normal": 10011 },
        "Гидро сопротивление": { "normal": 10012 },
        "Анемо сопротивление": { "normal": 10013 },
        "Гео сопротивление": { "normal": 10014 },
        "Дендро сопротивление": { "normal": 10015 }
    },
    "2000": { "Сила атаки": { "normal": 12001 } },
    "3000": {
        "HP": { "normal": 13001, "percent": 13002 },
        "Сила атаки": { "normal": 13003, "percent": 13004 },
        "Защита": { "normal": 13005, "percent": 13006 },
        "Шанс крит. попадания": { "normal": 13007 },
        "Крит. урон": { "normal": 13008 },
        "Бонус лечения": { "normal": 13009 },
        "Мастерство стихий": { "normal": 13010 }
    },
    "4000": { "HP": { "normal": 14001 } },
    "5000": {
        "HP": { "normal": 15001, "percent": 15002 },
        "Сила атаки": { "normal": 15003, "percent": 15004 },
        "Защита": { "normal": 15005, "percent": 15006 },
        "Мастерство стихий": { "normal": 15007 },
        "Бонус пиро урона": { "normal": 15008 },
        "Бонус электро урона": { "normal": 15009 },
        "Бонус крио урона": { "normal": 15010 },
        "Бонус гидро урона": { "normal": 15011 },
        "Бонус анемо урона": { "normal": 15012 },
        "Бонус гео урона": { "normal": 15013 },
        "Бонус дендро урона": { "normal": 15014 },
        "Бонус физ. урона": { "normal": 15015 }
    },
    "1099": { "Сила атаки": { "percent": 10990 } },
    "1098": { "HP": { "percent": 10980 } },
    "1097": { "Защита": { "percent": 10970 } },
    "1096": { "Восстановление энергии": { "normal": 10960 } },
    "1095": { "Мастерство стихий": { "normal": 10950 } },
    "3099": { "Сила атаки": { "percent": 30990 } },
    "3098": { "HP": { "percent": 30980 } },
    "3097": { "Защита": { "percent": 30970 } },
    "3096": { "Шанс крит. попадания": { "normal": 30960 } },
    "3095": { "Крит. урон": { "normal": 30950 } },
    "3094": { "Бонус лечения": { "normal": 30940 } },
    "3093": { "Мастерство стихий": { "normal": 30930 } },
    "5099": { "Сила атаки": { "percent": 50990 } },
    "5098": { "HP": { "percent": 50980 } },
    "5097": { "Защита": { "percent": 50970 } },
    "5096": { "Бонус пиро урона": { "normal": 50960 } },
    "5095": { "Бонус электро урона": { "normal": 50950 } },
    "5094": { "Бонус крио урона": { "normal": 50940 } },
    "5093": { "Бонус гидро урона": { "normal": 50930 } },
    "5092": { "Бонус анемо урона": { "normal": 50920 } },
    "5091": { "Бонус гео урона": { "normal": 50910 } },
    "5090": { "Бонус дендро урона": { "normal": 50900 } },
    "5089": { "Бонус физ. урона": { "normal": 50890 } },
    "5088": { "Мастерство стихий": { "normal": 50880 } }
}


var reli_affix_prop = {
    "101": {
        "HP": {
            "normal": { "101021": 23.899999618530273, "101022": 29.8799991607666 },
            "percent": { "101031": 0.011699999682605267, "101032": 0.014600000344216824 }
        },
        "Сила атаки": {
            "normal": { "101051": 1.559999942779541, "101052": 1.9500000476837158 },
            "percent": { "101061": 0.011699999682605267, "101062": 0.014600000344216824 }
        },
        "Защита": {
            "normal": { "101081": 1.850000023841858, "101082": 2.309999942779541 },
            "percent": { "101091": 0.014600000344216824, "101092": 0.018200000748038292 }
        },
        "Восстановление энергии": { "normal": { "101231": 0.013000000268220901, "101232": 0.016200000420212746 } },
        "Мастерство стихий": { "normal": { "101241": 4.659999847412109, "101242": 5.829999923706055 } },
        "Шанс крит. попадания": { "normal": { "101201": 0.007799999788403511, "101202": 0.009700000286102295 } },
        "Крит. урон": { "normal": { "101221": 0.01549999974668026, "101222": 0.01940000057220459 } }
    },
    "201": {
        "HP": {
            "normal": { "201021": 50.189998626708984, "201022": 60.95000076293945, "201023": 71.69999694824219 },
            "percent": { "201031": 0.016300000250339508, "201032": 0.01979999989271164, "201033": 0.02329999953508377 }
        },
        "Сила атаки": {
            "normal": { "201051": 3.2699999809265137, "201052": 3.9700000286102295, "201053": 4.670000076293945 },
            "percent": { "201061": 0.016300000250339508, "201062": 0.01979999989271164, "201063": 0.02329999953508377 }
        },
        "Защита": {
            "normal": { "201081": 3.890000104904175, "201082": 4.71999979019165, "201083": 5.559999942779541 },
            "percent": { "201091": 0.020400000736117363, "201092": 0.024800000712275505, "201093": 0.029100000858306885 }
        },
        "Восстановление энергии": { "normal": { "201231": 0.01810000091791153, "201232": 0.02199999988079071, "201233": 0.02590000070631504 } },
        "Мастерство стихий": { "normal": { "201241": 6.53000020980835, "201242": 7.929999828338623, "201243": 9.329999923706055 } },
        "Шанс крит. попадания": { "normal": { "201201": 0.010900000110268593, "201202": 0.013199999928474426, "201203": 0.01549999974668026 } },
        "Крит. урон": { "normal": { "201221": 0.021800000220537186, "201222": 0.026399999856948853, "201223": 0.031099999323487282 } }
    },
    "301": {
        "HP": {
            "normal": { "301021": 100.37999725341797, "301022": 114.72000122070312, "301023": 129.05999755859375, "301024": 143.39999389648438 },
            "percent": { "301031": 0.02449999935925007, "301032": 0.02800000086426735, "301033": 0.03150000050663948, "301034": 0.03500000014901161 }
        },
        "Сила атаки": {
            "normal": { "301051": 6.539999961853027, "301052": 7.46999979019165, "301053": 8.399999618530273, "301054": 9.34000015258789 },
            "percent": { "301061": 0.02449999935925007, "301062": 0.02800000086426735, "301063": 0.03150000050663948, "301064": 0.03500000014901161 }
        },
        "Защита": {
            "normal": { "301081": 7.78000020980835, "301082": 8.890000343322754, "301083": 10.0, "301084": 11.109999656677246 },
            "percent": { "301091": 0.03060000017285347, "301092": 0.03500000014901161, "301093": 0.03929999843239784, "301094": 0.043699998408555984 }
        },
        "Восстановление энергии": { "normal": { "301231": 0.0272000003606081, "301232": 0.031099999323487282, "301233": 0.03500000014901161, "301234": 0.03889999911189079 } },
        "Мастерство стихий": { "normal": { "301241": 9.789999961853027, "301242": 11.1899995803833, "301243": 12.59000015258789, "301244": 13.989999771118164 } },
        "Шанс крит. попадания": { "normal": { "301201": 0.016300000250339508, "301202": 0.01860000006854534, "301203": 0.020999999716877937, "301204": 0.02329999953508377 } },
        "Крит. урон": { "normal": { "301221": 0.032600000500679016, "301222": 0.037300001829862595, "301223": 0.041999999433755875, "301224": 0.04659999907016754 } }
    },
    "401": {
        "HP": {
            "normal": { "401021": 167.3000030517578, "401022": 191.1999969482422, "401023": 215.10000610351562, "401024": 239.0 },
            "percent": { "401031": 0.032600000500679016, "401032": 0.037300001829862595, "401033": 0.041999999433755875, "401034": 0.04659999907016754 }
        },
        "Сила атаки": {
            "normal": { "401051": 10.890000343322754, "401052": 12.449999809265137, "401053": 14.0, "401054": 15.5600004196167 },
            "percent": { "401061": 0.032600000500679016, "401062": 0.037300001829862595, "401063": 0.041999999433755875, "401064": 0.04659999907016754 }
        },
        "Защита": {
            "normal": { "401081": 12.960000038146973, "401082": 14.819999694824219, "401083": 16.670000076293945, "401084": 18.520000457763672 },
            "percent": { "401091": 0.040800001472234726, "401092": 0.04659999907016754, "401093": 0.05249999836087227, "401094": 0.05829999968409538 }
        },
        "Восстановление энергии": { "normal": { "401231": 0.03629999980330467, "401232": 0.0414000004529953, "401233": 0.04659999907016754, "401234": 0.05180000141263008 } },
        "Мастерство стихий": { "normal": { "401241": 13.0600004196167, "401242": 14.920000076293945, "401243": 16.790000915527344, "401244": 18.649999618530273 } },
        "Шанс крит. попадания": { "normal": { "401201": 0.021800000220537186, "401202": 0.024900000542402267, "401203": 0.02800000086426735, "401204": 0.031099999323487282 } },
        "Крит. урон": { "normal": { "401221": 0.04349999874830246, "401222": 0.04969999939203262, "401223": 0.0560000017285347, "401224": 0.062199998646974564 } }
    },
    "501": {
        "HP": {
            "normal": { "501021": 209.1300048828125, "501022": 239.0, "501023": 268.8800048828125, "501024": 298.75 },
            "percent": { "501031": 0.040800001472234726, "501032": 0.04659999907016754, "501033": 0.05249999836087227, "501034": 0.05829999968409538 }
        },
        "Сила атаки": {
            "normal": { "501051": 13.619999885559082, "501052": 15.5600004196167, "501053": 17.510000228881836, "501054": 19.450000762939453 },
            "percent": { "501061": 0.040800001472234726, "501062": 0.04659999907016754, "501063": 0.05249999836087227, "501064": 0.05829999968409538 }
        },
        "Защита": {
            "normal": { "501081": 16.200000762939453, "501082": 18.520000457763672, "501083": 20.829999923706055, "501084": 23.149999618530273 },
            "percent": { "501091": 0.050999999046325684, "501092": 0.05829999968409538, "501093": 0.06560000032186508, "501094": 0.07289999723434448 }
        },
        "Восстановление энергии": { "normal": { "501231": 0.04529999941587448, "501232": 0.05180000141263008, "501233": 0.05829999968409538, "501234": 0.06480000168085098 } },
        "Мастерство стихий": { "normal": { "501241": 16.31999969482422, "501242": 18.649999618530273, "501243": 20.979999542236328, "501244": 23.309999465942383 } },
        "Шанс крит. попадания": { "normal": { "501201": 0.0272000003606081, "501202": 0.031099999323487282, "501203": 0.03500000014901161, "501204": 0.03889999911189079 } },
        "Крит. урон": { "normal": { "501221": 0.0544000007212162, "501222": 0.062199998646974564, "501223": 0.06989999860525131, "501224": 0.07769999653100967 } }
    },
    "999": {
        "Крит. урон": { "normal": { "999001": 3.5 } },
        "Шанс крит. попадания": { "normal": { "999002": 1.0 } },
        "Сила атаки": { "normal": { "999003": 233333.0 } },
        "Защита": { "normal": { "999004": 233333.0 } }
    },
    "998": {
        "HP": { "percent": { "998001": 0.14569999277591705 } },
        "Сила атаки": { "percent": { "998002": 0.14569999277591705 } },
        "Защита": { "percent": { "998003": 0.18209999799728394 } },
        "Шанс крит. попадания": { "normal": { "998004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "998005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "998006": 58.279998779296875 } },
        "Крит. урон": { "normal": { "998007": 0.19429999589920044 } }
    },
    "995": {
        "HP": { "percent": { "995001": 0.14569999277591705 } },
        "Сила атаки": { "percent": { "995002": 0.14569999277591705 } },
        "Защита": { "percent": { "995003": 0.18209999799728394 } },
        "Шанс крит. попадания": { "normal": { "995004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "995005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "995006": 58.279998779296875 } },
        "Крит. урон": { "normal": { "995007": 0.19429999589920044 } }
    },
    "997": {
        "HP": { "percent": { "997001": 0.09319999814033508 } },
        "Сила атаки": { "percent": { "997002": 0.09319999814033508 } },
        "Защита": { "percent": { "997003": 0.11659999936819077 } },
        "Шанс крит. попадания": { "normal": { "997004": 0.062199998646974564 } },
        "Восстановление энергии": { "normal": { "997005": 0.10360000282526016 } },
        "Мастерство стихий": { "normal": { "997006": 37.29999923706055 } },
        "Крит. урон": { "normal": { "997007": 0.12430000305175781 } }
    },
    "996": {
        "HP": { "percent": { "996001": 0.09319999814033508 } },
        "Сила атаки": { "percent": { "996002": 0.09319999814033508 } },
        "Защита": { "percent": { "996003": 0.11659999936819077 } },
        "Шанс крит. попадания": { "normal": { "996004": 0.062199998646974564 } },
        "Восстановление энергии": { "normal": { "996005": 0.10360000282526016 } },
        "Мастерство стихий": { "normal": { "996006": 37.29999923706055 } },
        "Крит. урон": { "normal": { "996007": 0.12430000305175781 } }
    },
    "994": { "Шанс крит. попадания": { "normal": { "994001": 0.800000011920929 } } },
    "993": { "Крит. урон": { "normal": { "993001": 0.800000011920929 } } },
    "992": { "SHIELD_COST_MINUS_RATIO": { "normal": { "992001": 0.800000011920929 } } },
    "991": { "Бонус лечения": { "normal": { "991001": 0.800000011920929 } } },
    "990": { "HEALED_ADD": { "normal": { "990001": 0.800000011920929 } } },
    "989": { "SKILL_CD_MINUS_RATIO": { "normal": { "989001": 0.5 } } },
    "988": { "SPEED": { "percent": { "988001": 0.30000001192092896 } } },
    "987": { "Бонус пиро урона": { "normal": { "987001": 0.800000011920929 } } },
    "986": { "Бонус электро урона": { "normal": { "986001": 0.800000011920929 } } },
    "985": { "Бонус гидро урона": { "normal": { "985001": 0.800000011920929 } } },
    "984": { "Бонус дендро урона": { "normal": { "984001": 0.800000011920929 } } },
    "983": { "Бонус анемо урона": { "normal": { "983001": 0.800000011920929 } } },
    "982": { "Бонус гео урона": { "normal": { "982001": 0.800000011920929 } } },
    "981": { "Бонус крио урона": { "normal": { "981001": 0.800000011920929 } } },
    "980": { "Бонус физ. урона": { "normal": { "980001": 0.800000011920929 } } },
    "979": { "Пиро сопротивление": { "normal": { "979001": 0.800000011920929 } } },
    "978": { "Электро сопротивление": { "normal": { "978001": 0.800000011920929 } } },
    "977": { "Гидро сопротивление": { "normal": { "977001": 0.800000011920929 } } },
    "976": { "Дендро сопротивление": { "normal": { "976001": 0.800000011920929 } } },
    "975": { "Анемо сопротивление": { "normal": { "975001": 0.800000011920929 } } },
    "974": { "Гео сопротивление": { "normal": { "974001": 0.800000011920929 } } },
    "973": { "Крио сопротивление": { "normal": { "973001": 0.800000011920929 } } },
    "972": { "PHYSICAL_SUB_HURT": { "normal": { "972001": 0.800000011920929 } } },
    "971": { "ADD_HURT": { "normal": { "971001": 0.800000011920929 } } },
    "970": { "SUB_HURT": { "normal": { "970001": 0.800000011920929 } } },
    "969": { "Защита": { "normal": { "969001": -500.0 } } },
    "968": { "Мастерство стихий": { "normal": { "968001": -300.0 } } },
    "951": {
        "HP": { "percent": { "951001": 0.14569999277591705 } },
        "Сила атаки": { "percent": { "951002": 0.14569999277591705 } },
        "Защита": { "percent": { "951003": 0.18209999799728394 } },
        "Шанс крит. попадания": { "normal": { "951004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "951005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "951006": 58.279998779296875 } },
        "Крит. урон": { "normal": { "951007": 0.19429999589920044 } }
    },
    "952": {
        "HP": { "percent": { "952001": 0.14569999277591705 } },
        "Сила атаки": { "percent": { "952002": 0.14569999277591705 } },
        "Защита": { "percent": { "952003": 0.18209999799728394 } },
        "Шанс крит. попадания": { "normal": { "952004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "952005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "952006": 58.279998779296875 } },
        "Крит. урон": { "normal": { "952007": 0.19429999589920044 } }
    },
    "953": {
        "HP": { "percent": { "953001": 0.14569999277591705 } },
        "Сила атаки": { "percent": { "953002": 0.14569999277591705 } },
        "Защита": { "percent": { "953003": 0.18209999799728394 } },
        "Шанс крит. попадания": { "normal": { "953004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "953005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "953006": 58.279998779296875 } },
        "Крит. урон": { "normal": { "953007": 0.19429999589920044 } }
    },
    "956": {
        "HP": { "percent": { "956001": 0.14569999277591705 } },
        "Сила атаки": { "percent": { "956002": 0.14569999277591705 } },
        "Защита": { "percent": { "956003": 0.18209999799728394 } },
        "Шанс крит. попадания": { "normal": { "956004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "956005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "956006": 58.279998779296875 } },
        "Крит. урон": { "normal": { "956007": 0.19429999589920044 } }
    },
    "941": {
        "HP": { "percent": { "941001": 0.09319999814033508 } },
        "Сила атаки": { "percent": { "941002": 0.09319999814033508 } },
        "Защита": { "percent": { "941003": 0.11659999936819077 } },
        "Шанс крит. попадания": { "normal": { "941004": 0.062199998646974564 } },
        "Восстановление энергии": { "normal": { "941005": 0.10360000282526016 } },
        "Мастерство стихий": { "normal": { "941006": 37.29999923706055 } },
        "Крит. урон": { "normal": { "941007": 0.12430000305175781 } }
    },
    "942": {
        "HP": { "percent": { "942001": 0.09319999814033508 } },
        "Сила атаки": { "percent": { "942002": 0.09319999814033508 } },
        "Защита": { "percent": { "942003": 0.11659999936819077 } },
        "Шанс крит. попадания": { "normal": { "942004": 0.062199998646974564 } },
        "Восстановление энергии": { "normal": { "942005": 0.10360000282526016 } },
        "Мастерство стихий": { "normal": { "942006": 37.29999923706055 } },
        "Крит. урон": { "normal": { "942007": 0.12430000305175781 } }
    },
    "943": {
        "HP": { "percent": { "943001": 0.09319999814033508 } },
        "Сила атаки": { "percent": { "943002": 0.09319999814033508 } },
        "Защита": { "percent": { "943003": 0.11659999936819077 } },
        "Шанс крит. попадания": { "normal": { "943004": 0.062199998646974564 } },
        "Восстановление энергии": { "normal": { "943005": 0.10360000282526016 } },
        "Мастерство стихий": { "normal": { "943006": 37.29999923706055 } },
        "Крит. урон": { "normal": { "943007": 0.12430000305175781 } }
    },
    "946": {
        "HP": { "percent": { "946001": 0.09319999814033508 } },
        "Сила атаки": { "percent": { "946002": 0.09319999814033508 } },
        "Защита": { "percent": { "946003": 0.11659999936819077 } },
        "Шанс крит. попадания": { "normal": { "946004": 0.062199998646974564 } },
        "Восстановление энергии": { "normal": { "946005": 0.10360000282526016 } },
        "Мастерство стихий": { "normal": { "946006": 37.29999923706055 } },
        "Крит. урон": { "normal": { "946007": 0.12430000305175781 } }
    },
    "961": {
        "HP": {
            "percent": { "961001": 0.09713800251483917 },
            "normal": { "961008": 746.8800048828125 }
        },
        "Сила атаки": {
            "percent": { "961002": 0.14569999277591705 },
            "normal": { "961009": 48.630001068115234 }
        },
        "Защита": {
            "percent": { "961003": 0.12140599638223648 },
            "normal": { "961010": 57.869998931884766 }
        },
        "Шанс крит. попадания": { "normal": { "961004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "961005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "961006": 38.85527420043945 } },
        "Крит. урон": { "normal": { "961007": 0.19429999589920044 } }
    },
    "962": {
        "HP": {
            "percent": { "962001": 0.09713800251483917 },
            "normal": { "962008": 746.8800048828125 }
        },
        "Сила атаки": {
            "percent": { "962002": 0.14569999277591705 },
            "normal": { "962009": 48.630001068115234 }
        },
        "Защита": {
            "percent": { "962003": 0.12140599638223648 },
            "normal": { "962010": 57.869998931884766 }
        },
        "Шанс крит. попадания": { "normal": { "962004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "962005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "962006": 38.85527420043945 } },
        "Крит. урон": { "normal": { "962007": 0.19429999589920044 } }
    },
    "963": {
        "HP": {
            "percent": { "963001": 0.09713800251483917 },
            "normal": { "963008": 746.8800048828125 }
        },
        "Сила атаки": {
            "percent": { "963002": 0.14569999277591705 },
            "normal": { "963009": 48.630001068115234 }
        },
        "Защита": {
            "percent": { "963003": 0.12140599638223648 },
            "normal": { "963010": 57.869998931884766 }
        },
        "Шанс крит. попадания": { "normal": { "963004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "963005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "963006": 38.85527420043945 } },
        "Крит. урон": { "normal": { "963007": 0.19429999589920044 } }
    },
    "964": {
        "HP": {
            "percent": { "964001": 0.09713800251483917 },
            "normal": { "964008": 746.8800048828125 }
        },
        "Сила атаки": {
            "percent": { "964002": 0.14569999277591705 },
            "normal": { "964009": 48.630001068115234 }
        },
        "Защита": {
            "percent": { "964003": 0.12140599638223648 },
            "normal": { "964010": 57.869998931884766 }
        },
        "Шанс крит. попадания": { "normal": { "964004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "964005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "964006": 38.85527420043945 } },
        "Крит. урон": { "normal": { "964007": 0.19429999589920044 } }
    },
    "965": {
        "HP": {
            "percent": { "965001": 0.09713800251483917 },
            "normal": { "965008": 746.8800048828125 }
        },
        "Сила атаки": {
            "percent": { "965002": 0.14569999277591705 },
            "normal": { "965009": 48.630001068115234 }
        },
        "Защита": {
            "percent": { "965003": 0.12140599638223648 },
            "normal": { "965010": 57.869998931884766 }
        },
        "Шанс крит. попадания": { "normal": { "965004": 0.09709999710321426 } },
        "Восстановление энергии": { "normal": { "965005": 0.16189999878406525 } },
        "Мастерство стихий": { "normal": { "965006": 38.85527420043945 } },
        "Крит. урон": { "normal": { "965007": 0.19429999589920044 } }
    }
};


var monster_data = [
    { "id": "20010101", "name": "Дендро слайм", "type": 0 },
    { "id": "20010201", "name": "Большой дендро слайм", "type": 0 },
    { "id": "20010202", "name": "Большой дендро слайм (Особенный...)", "type": 0 },
    { "id": "20010301", "name": "Анемо слайм", "type": 0 },
    { "id": "20010302", "name": "Анемо слайм (Механикус)", "type": 0 },
    { "id": "20010401", "name": "Большой анемо слайм", "type": 0 },
    { "id": "20010402", "name": "Большой анемо слайм (Механикус)", "type": 0 },
    { "id": "20010403", "name": "Большой анемо слайм (Особенный...)", "type": 0 },
    { "id": "20010501", "name": "Электро слайм", "type": 0 },
    { "id": "20010502", "name": "Электро слайм (Механикус)", "type": 0 },
    { "id": "20010601", "name": "Большой электро слайм", "type": 0 },
    { "id": "20010602", "name": "Большой электро слайм (Механикус)", "type": 0 },
    { "id": "20010604", "name": "Большой электро слайм (Особенный...)", "type": 0 },
    { "id": "20010701", "name": "Мутировавший электро слайм", "type": 0 },
    { "id": "20010702", "name": "Мутировавший электро слайм (Особенный...)", "type": 0 },
    { "id": "20010703", "name": "Мутировавший электро слайм (Механикус)", "type": 0 },
    { "id": "20010801", "name": "Крио слайм", "type": 0 },
    { "id": "20010802", "name": "Крио слайм - Dragonspine Ивент", "type": 0 },
    { "id": "20010803", "name": "Крио слайм (Механикус)", "type": 0 },
    { "id": "20010901", "name": "Большой крио слайм", "type": 0 },
    { "id": "20010902", "name": "Большой крио слайм - Snowy Mountain Ивент", "type": 0 },
    { "id": "20010903", "name": "Большой крио слайм (Механикус)", "type": 0 },
    { "id": "20010904", "name": "Большой крио слайм (Особенный...)", "type": 0 },
    { "id": "20011001", "name": "Гидро слайм", "type": 0 },
    { "id": "20011002", "name": "Гидро слайм (Механикус)", "type": 0 },
    { "id": "20011101", "name": "Большой гидро слайм", "type": 0 },
    { "id": "20011102", "name": "Большой гидро слайм (Механикус)", "type": 0 },
    { "id": "20011103", "name": "Большой гидро слайм (Особенный...)", "type": 0 },
    { "id": "20011201", "name": "Пиро слайм", "type": 0 },
    { "id": "20011202", "name": "Пиро слайм", "type": 0 },
    { "id": "20011203", "name": "Пиро слайм (Механикус)", "type": 0 },
    { "id": "20011301", "name": "Большой пиро слайм", "type": 0 },
    { "id": "20011302", "name": "Большой пиро слайм (Механикус)", "type": 0 },
    { "id": "20011304", "name": "Большой пиро слайм (Особенный...)", "type": 0 },
    { "id": "20011401", "name": "Гео слайм", "type": 0 },
    { "id": "20011402", "name": "Гео слайм (Механикус)", "type": 0 },
    { "id": "20011501", "name": "Большой гео слайм", "type": 0 },
    { "id": "20011502", "name": "Большой гео слайм (Особенный...)", "type": 0 },
    { "id": "20011503", "name": "Большой гео слайм (Механикус)", "type": 0 },
    { "id": "20011601", "name": "Слайм гидро гипостазиса: Split (L)", "type": 0 },
    { "id": "20011701", "name": "Слайм гидро гипостазиса: Split (S)", "type": 0 },
    { "id": "20011801", "name": "Слайм гидро гипостазиса: Self-Destruct", "type": 0 },
    { "id": "20011901", "name": "Слайм гидро гипостазиса: Heal", "type": 0 },
    { "id": "20020101", "name": "Глаз бури", "type": 0 },
    { "id": "20040101", "name": "Электро гипостазис - Aleph", "type": 1 },
    { "id": "20040102", "name": "(Ивент) Электро гипостазис - Aleph", "type": 1 },
    { "id": "20040201", "name": "Анемо гипостазис - Beth", "type": 1 },
    { "id": "20040202", "name": "(Ивент) Анемо гипостазис - Beth", "type": 1 },
    { "id": "20040301", "name": "Гео гипостазис: Gimel", "type": 1 },
    { "id": "20040302", "name": "(Ивент) Гео гипостазис - Gimel", "type": 1 },
    { "id": "20040401", "name": "Гидро гипостазис", "type": 1 },
    { "id": "20040501", "name": "Крио гипостазис - Daleth", "type": 1 },
    { "id": "20040601", "name": "Пиро гипостазис: Ayin", "type": 1 },
    { "id": "20050101", "name": "Океанид", "type": 1 },
    { "id": "20050102", "name": "Океанид (Main Body)", "type": 1 },
    { "id": "20050201", "name": "Кабан океанида", "type": 0 },
    { "id": "20050202", "name": "Кабан океанида (Enhanced)", "type": 0 },
    { "id": "20050203", "name": "Кабан океанида (Особенный...)", "type": 0 },
    { "id": "20050301", "name": "Журавль акеанида", "type": 0 },
    { "id": "20050302", "name": "Журавль акеанида (Особенный...)", "type": 0 },
    { "id": "20050401", "name": "Краб океанида", "type": 0 },
    { "id": "20050402", "name": "Краб океанида (Enhanced)", "type": 0 },
    { "id": "20050403", "name": "Краб океанида (Особенный...)", "type": 0 },
    { "id": "20050501", "name": "Зяблик океанида", "type": 0 },
    { "id": "20050502", "name": "Зяблик океанида (Особенный...)", "type": 0 },
    { "id": "20050601", "name": "Утка океанида", "type": 0 },
    { "id": "20050602", "name": "Утка океанида (Landwalker Version)", "type": 0 },
    { "id": "20050603", "name": "Утка океанида (Особенный...)", "type": 0 },
    { "id": "20050701", "name": "Хорёк океанида", "type": 0 },
    { "id": "20050702", "name": "Хорёк океанида (Enhanced)", "type": 0 },
    { "id": "20050703", "name": "Хорёк океанида (Особенный...)", "type": 0 },
    { "id": "20050801", "name": "Лягушка океанида", "type": 0 },
    { "id": "20050802", "name": "Лягушка океанида (Особенный...)", "type": 0 },
    { "id": "20050901", "name": "Хищная птица океанида", "type": 0 },
    { "id": "20060101", "name": "Гидро призрак", "type": 0 },
    { "id": "20060201", "name": "Гео призрак", "type": 0 },
    { "id": "20060301", "name": "Анемо призрак", "type": 0 },
    { "id": "20060401", "name": "Крио призрак", "type": 0 },
    { "id": "20060501", "name": "Электро призрак", "type": 0 },
    { "id": "20060601", "name": "Пиро призрак", "type": 0 },
    { "id": "20070101", "name": "Манифестация грома", "type": 1 },
    { "id": "21010101", "name": "Хиличурл", "type": 0 },
    { "id": "21010102", "name": "Хиличурл (Механикус)", "type": 0 },
    { "id": "21010201", "name": "Хиличурл-боец", "type": 0 },
    { "id": "21010301", "name": "Хиличурл с деревянным щитом", "type": 0 },
    { "id": "21010302", "name": "Хиличурл с деревянным щитом (Механикус)", "type": 0 },
    { "id": "21010401", "name": "Хиличурл-стрелок", "type": 0 },
    { "id": "21010402", "name": "Test_Varied Хиличурл-стрелок", "type": 0 },
    { "id": "21010501", "name": "Пиро хиличурл-стрелок", "type": 0 },
    { "id": "21010502", "name": "Test_Varied Пиро хиличурл-стрелок", "type": 0 },
    { "id": "21010601", "name": "Хиличурл-гренадёр", "type": 0 },
    { "id": "21010603", "name": "Пиро хиличурл-гренадёр", "type": 0 },
    { "id": "21010701", "name": "Хиличурл-берсерк", "type": 0 },
    { "id": "21010702", "name": "Хиличурл-берсерк (Механикус)", "type": 0 },
    { "id": "21010901", "name": "Крио хиличурл-стрелок", "type": 0 },
    { "id": "21010902", "name": "Test_Varied Крио хиличурл-стрелок", "type": 0 },
    { "id": "21011001", "name": "Электро хиличурл-стрелок", "type": 0 },
    { "id": "21011002", "name": "Test_Varied Электро хиличурл-стрелок", "type": 0 },
    { "id": "21011201", "name": "Хиличурл с каменным щитом", "type": 0 },
    { "id": "21011202", "name": "Хиличурл с каменным щитом (Механикус)", "type": 0 },
    { "id": "21011301", "name": "Крио хиличурл-гренадёр", "type": 0 },
    { "id": "21011302", "name": "Крио хиличурл-гренадёр - Enhanced Attack", "type": 0 },
    { "id": "21011401", "name": "Хиличурл с ледяным щитом", "type": 0 },
    { "id": "21011402", "name": "Хиличурл с ледяным щитом (Механикус)", "type": 0 },
    { "id": "21011403", "name": "Хиличурл с ледяным щитом: Dragonspine Ивент", "type": 0 },
    { "id": "21011501", "name": "Странный хиличурл", "type": 0 },
    { "id": "21011601", "name": "Электро хиличурл-гренадёр", "type": 0 },
    { "id": "21011602", "name": "Электро хиличурл-гренадёр - Enhanced Attack", "type": 0 },
    { "id": "21020101", "name": "Митачурл с деревянным щитом", "type": 0 },
    { "id": "21020102", "name": "Митачурл с деревянным щитом (Механикус)", "type": 0 },
    { "id": "21020201", "name": "Митачурл с огненным топором", "type": 0 },
    { "id": "21020202", "name": "Митачурл с огненным топором (Особенный...)", "type": 0 },
    { "id": "21020203", "name": "Митачурл с огненным топором (Механикус)", "type": 0 },
    { "id": "21020301", "name": "Митачурл с каменным щитом", "type": 0 },
    { "id": "21020302", "name": "Митачурл с каменным щитом (Механикус)", "type": 0 },
    { "id": "21020401", "name": "Лавачурл с инеевым панцирем", "type": 0 },
    { "id": "21020402", "name": "Лавачурл с инеевым панцирем (Механикус)", "type": 0 },
    { "id": "21020501", "name": "Лавачурл с каменным панцирем", "type": 0 },
    { "id": "21020502", "name": "Лавачурл с каменным панцирем (Механикус)", "type": 0 },
    { "id": "21020601", "name": "Митачурл с ледяным щитом", "type": 0 },
    { "id": "21020602", "name": "Митачурл с ледяным щитом (Механикус)", "type": 0 },
    { "id": "21020701", "name": "Митачурл с электрическим топором", "type": 0 },
    { "id": "21020702", "name": "Митачурл с электрическим топором (Механикус)", "type": 0 },
    { "id": "21020703", "name": "Митачурл с электрическим топором - Enhanced Attack", "type": 0 },
    { "id": "21020801", "name": "Лавачурл с громовым шлемом", "type": 0 },
    { "id": "21020802", "name": "Лавачурл с громовым шлемом (Механикус)", "type": 0 },
    { "id": "21030101", "name": "Гидро шамачурл", "type": 0 },
    { "id": "21030102", "name": "Гидро шамачурл (Механикус)", "type": 0 },
    { "id": "21030103", "name": "Test_Movement Исцеляющий гидро шамачурл", "type": 0 },
    { "id": "21030201", "name": "Дендро шамачурл", "type": 0 },
    { "id": "21030202", "name": "Дендро шамачурл (Механикус)", "type": 0 },
    { "id": "21030203", "name": "Дендро шамачурл (Особенный...)", "type": 0 },
    { "id": "21030301", "name": "Анемо шамачурл", "type": 0 },
    { "id": "21030302", "name": "Анемо шамачурл (Механикус)", "type": 0 },
    { "id": "21030303", "name": "Test_Wind Current Enhanced Анемо шамачурл", "type": 0 },
    { "id": "21030304", "name": "Анемо шамачурл", "type": 0 },
    { "id": "21030401", "name": "Гео шамачурл", "type": 0 },
    { "id": "21030402", "name": "Гео шамачурл", "type": 0 },
    { "id": "21030403", "name": "Гео шамачурл (Механикус)", "type": 0 },
    { "id": "21030501", "name": "Крио шамачурл", "type": 0 },
    { "id": "21030502", "name": "Крио шамачурл (Механикус)", "type": 0 },
    { "id": "21030601", "name": "Электро шамачурл", "type": 0 },
    { "id": "21030602", "name": "Электро шамачурл (Механикус)", "type": 0 },
    { "id": "21030603", "name": "Электро шамачурл - Enhanced Support", "type": 0 },
    { "id": "22010101", "name": "Пиро маг бездны", "type": 0 },
    { "id": "22010102", "name": "Test_Shield-Enhanced Пиро маг бездны", "type": 0 },
    { "id": "22010103", "name": "Test_Teleport-Enhanced Пиро маг бездны", "type": 0 },
    { "id": "22010104", "name": "Test_Attacking-Enhanced Пиро маг бездны", "type": 0 },
    { "id": "22010105", "name": "Пиро маг бездны (Механикус)", "type": 0 },
    { "id": "22010201", "name": "Крио маг бездны", "type": 0 },
    { "id": "22010202", "name": "Test_Shield-Enhanced Крио маг бездны", "type": 0 },
    { "id": "22010203", "name": "Test_Teleport-Enhanced Крио маг бездны", "type": 0 },
    { "id": "22010204", "name": "Test_Attacking-Enhanced Крио маг бездны", "type": 0 },
    { "id": "22010205", "name": "Крио маг бездны (Механикус)", "type": 0 },
    { "id": "22010301", "name": "Гидро маг бездны", "type": 0 },
    { "id": "22010302", "name": "Test_Shield-Enhanced Гидро маг бездны", "type": 0 },
    { "id": "22010303", "name": "Test_Teleport-Enhanced Гидро маг бездны", "type": 0 },
    { "id": "22010304", "name": "Test_Attacking-Enhanced Гидро маг бездны", "type": 0 },
    { "id": "22010305", "name": "Гидро маг бездны (Механикус)", "type": 0 },
    { "id": "22010401", "name": "Электро маг бездны", "type": 0 },
    { "id": "22010402", "name": "Электро маг бездны (Механикус)", "type": 0 },
    { "id": "22010403", "name": "Электро маг бездны - Enhanced Shield", "type": 0 },
    { "id": "22010404", "name": "Электро маг бездны - Enhanced Attack", "type": 0 },
    { "id": "22020101", "name": "Вестник Бездны: Злые течения (Disappearing)", "type": 0 },
    { "id": "22020102", "name": "Вестник Бездны: Злые течения (Permanent)", "type": 0 },
    { "id": "22030101", "name": "Чтец Бездны: Пурпурная молния (Disappearing)", "type": 0 },
    { "id": "22030102", "name": "Чтец Бездны: Пурпурная молния (Permanent)", "type": 0 },
    { "id": "22030201", "name": "Чтец Бездны: Пламя бездны", "type": 0 },
    { "id": "22030202", "name": "Чтец Бездны: Пламя бездны", "type": 0 },
    { "id": "22040101", "name": "Щенок Разрыва: Камнегрыз", "type": 0 },
    { "id": "22040201", "name": "Щенок Разрыва: Громоед", "type": 0 },
    { "id": "22050101", "name": "Гончая Разрыва: Камнегрыз", "type": 0 },
    { "id": "22050201", "name": "Гончая Разрыва: Громоед", "type": 0 },
    { "id": "22060101", "name": "Золотой волчий вожак", "type": 1 },
    { "id": "22070101", "name": "Чёрный доспех: Знаменосец", "type": 0 },
    { "id": "22070102", "name": "Чёрный доспех: Знаменосец (Хз чем отличается)", "type": 0 },
    { "id": "22070201", "name": "Чёрный доспех: Штурмовик", "type": 0 },
    { "id": "22070202", "name": "Чёрный доспех: Штурмовик (Хз чем отличается)", "type": 0 },
    { "id": "22070301", "name": "Чёрный доспех: Гвардеец", "type": 0 },
    { "id": "22070302", "name": "Чёрный доспех: Гвардеец (Хз чем отличается)", "type": 0 },
    { "id": "22080101", "name": "Рыцарь Чёрного Змея: Разрезающий ветер", "type": 0 },
    { "id": "23010101", "name": "Застрельщик Фатуи: Крио бомбардир", "type": 0 },
    { "id": "23010201", "name": "Застрельщик Фатуи: Гидро бомбардир", "type": 0 },
    { "id": "23010301", "name": "Застрельщик Фатуи: Электро молотобоец", "type": 0 },
    { "id": "23010401", "name": "Застрельщик Фатуи: Гео заклинатель", "type": 0 },
    { "id": "23010501", "name": "Застрельщик Фатуи: Анемо борец", "type": 0 },
    { "id": "23010601", "name": "Застрельщик Фатуи: Пиро мушкетёр", "type": 0 },
    { "id": "23020101", "name": "Фатуи: Пиро агент", "type": 0 },
    { "id": "23020102", "name": "Фатуи: Пиро агент (Хз чем отличается)", "type": 0 },
    { "id": "23030101", "name": "Фатуи: Маг Электро цицинов", "type": 0 },
    { "id": "23030102", "name": "Фатуи: Маг Электро цицинов (Хз чем отличается)", "type": 0 },
    { "id": "23040101", "name": "Фатуи: Маг Крио цицинов", "type": 0 },
    { "id": "23040102", "name": "Фатуи: Маг Крио цицинов - Enhanced Attack", "type": 0 },
    { "id": "23050101", "name": "Зеркальная дева Фатуи", "type": 0 },
    { "id": "24010101", "name": "Страж руин", "type": 0 },
    { "id": "24010102", "name": "Страж руин (Механикус)", "type": 0 },
    { "id": "24010108", "name": "Страж руин (Бессмертный какой-то)", "type": 0 },
    { "id": "24010109", "name": "Страж руин (Тоже бессмертный какой-то)", "type": 0 },
    { "id": "24010201", "name": "Руинный охотник", "type": 0 },
    { "id": "24010202", "name": "Руинный охотник (Механикус)", "type": 0 },
    { "id": "24010301", "name": "Руинный молотильщик", "type": 0 },
    { "id": "24010302", "name": "Руинный молотильщик (Механикус)", "type": 0 },
    { "id": "24010303", "name": "Руинный молотильщик (Mining Version)", "type": 0 },
    { "id": "24010401", "name": "Змей руин", "type": 1 },
    { "id": "24020101", "name": "Руинный патрульный", "type": 0 },
    { "id": "24020102", "name": "Руинный патрульный (Weakened)", "type": 0 },
    { "id": "24020103", "name": "Руинный патрульный (Enhanced)", "type": 0 },
    { "id": "24020201", "name": "Руинный крушитель", "type": 0 },
    { "id": "24020202", "name": "Руинный крушитель (Weakened)", "type": 0 },
    { "id": "24020203", "name": "Руинный крушитель (Enhanced)", "type": 0 },
    { "id": "24020301", "name": "Руинный защитник", "type": 0 },
    { "id": "24020302", "name": "Руинный защитник (Weakened)", "type": 0 },
    { "id": "24020303", "name": "Руинный защитник (Enhanced)", "type": 0 },
    { "id": "24020401", "name": "Руинный шпион", "type": 0 },
    { "id": "24020402", "name": "Руинный шпион (Weakened)", "type": 0 },
    { "id": "24020403", "name": "Руинный шпион (Enhanced)", "type": 0 },
    { "id": "24021101", "name": "Бесконечный механический массив", "type": 1 },
    { "id": "24021102", "name": "Бесконечный механический массив (Эксклюзив события в Инадзуме)", "type": 1 },
    { "id": "25010101", "name": "Похититель сокровищ: Лю Лю", "type": 0 },
    { "id": "25010102", "name": "Таинственный человек 1", "type": 0 },
    { "id": "25010103", "name": "Таинственный человек 2", "type": 0 },
    { "id": "25010104", "name": "Таинственный человек 3", "type": 0 },
    { "id": "25010105", "name": "Похититель сокровищ: Лю Лю (с арбалетом)", "type": 0 },
    { "id": "25010106", "name": "Похититель сокровищ: Лю Лю (с арбалетом 2)", "type": 0 },
    { "id": "25010201", "name": "Похититель сокровищ: Разведчик", "type": 0 },
    { "id": "25010203", "name": "Квестовый чел 1", "type": 0 },
    { "id": "25010204", "name": "Квестовый чел 2", "type": 0 },
    { "id": "25010205", "name": "Квестовый чел 3", "type": 0 },
    { "id": "25010206", "name": "Квестовый чел 4", "type": 0 },
    { "id": "25010207", "name": "Квестовый чел 5", "type": 0 },
    { "id": "25010208", "name": "Квестовый чел 6", "type": 0 },
    { "id": "25010301", "name": "Похититель сокровищ: Пиро химик", "type": 0 },
    { "id": "25010302", "name": "Квестовый чел 8", "type": 0 },
    { "id": "25010401", "name": "Похититель сокровищ: Гидро химик", "type": 0 },
    { "id": "25010501", "name": "Похититель сокровищ: Электро химик", "type": 0 },
    { "id": "25010601", "name": "Похититель сокровищ: Крио химик", "type": 0 },
    { "id": "25010701", "name": "Похититель сокровищ: Разнорабочий", "type": 0 },
    { "id": "25020101", "name": "Похититель сокровищ: Птеродактиль", "type": 0 },
    { "id": "25020102", "name": "Похититель сокровищ: Стрелок 1", "type": 0 },
    { "id": "25020201", "name": "Похититель сокровищ: Стрелок 2", "type": 0 },
    { "id": "25020204", "name": "Похититель сокровищ: Стрелок 3 (Особенный...)", "type": 0 },
    { "id": "25030101", "name": "Похититель сокровищ: Кармен", "type": 0 },
    { "id": "25030102", "name": "Похититель сокровищ: Кармен 2", "type": 0 },
    { "id": "25030103", "name": "Похититель сокровищ: Кармен 3", "type": 0 },
    { "id": "25030201", "name": "Похититель сокровищ: Могильщик", "type": 0 },
    { "id": "25030301", "name": "Похититель сокровищ: Гребец", "type": 0 },
    { "id": "25040101", "name": "Похититель сокровищ: Старшая Сестричка", "type": 0 },
    { "id": "25040102", "name": "Похититель сокровищ: Старшая Сестричка 2", "type": 0 },
    { "id": "25040103", "name": "Похититель сокровищ: Старшая Сестричка 3", "type": 0 },
    { "id": "25050101", "name": "Солдат Миллелитов", "type": 0 },
    { "id": "25050201", "name": "Сержант Миллелитов", "type": 0 },
    { "id": "25050301", "name": "Пехотинец сёгуната", "type": 0 },
    { "id": "25050401", "name": "Капитан пехоты сёгуната 1", "type": 0 },
    { "id": "25050402", "name": "Капитан пехоты сёгуната 2", "type": 0 },
    { "id": "25050501", "name": "Сторонник Сангономии 1", "type": 0 },
    { "id": "25050502", "name": "Сторонник Сангономии 2", "type": 0 },
    { "id": "25060101", "name": "Похититель сокровищ: Боксёр", "type": 0 },
    { "id": "25060102", "name": "Похитители сокровищ: Боксёр (Особенный...)", "type": 0 },
    { "id": "25070101", "name": "Похитители сокровищ: Сокрушитель", "type": 0 },
    { "id": "25070201", "name": "Похитители сокровищ: Валенштайн", "type": 0 },
    { "id": "25070202", "name": "Похитители сокровищ: Валенштайн", "type": 0 },
    { "id": "25080101", "name": "Нобуси: Дзинтобан", "type": 0 },
    { "id": "25080201", "name": "Нобуси: Хицукэбан", "type": 0 },
    { "id": "25080202", "name": "Нобуси: Хицукэбан (Особенный...)", "type": 0 },
    { "id": "25080301", "name": "Нобуси: Кикобан", "type": 0 },
    { "id": "25080401", "name": "Самурай сёгуната", "type": 0 },
    { "id": "25080402", "name": "Самурай сёгуната 2", "type": 0 },
    { "id": "25090101", "name": "Магу кэнки", "type": 1 },
    { "id": "25090102", "name": "Магу кэнки: Бунсин ветра", "type": 1 },
    { "id": "25090103", "name": "Магу кэнки: Бунсин льда", "type": 1 },
    { "id": "25090104", "name": "Магу кэнки: Masked Bunshin", "type": 1 },
    { "id": "25090201", "name": "Магу кэнки: Бунсин ветра (С иконкой)", "type": 1 },
    { "id": "25090301", "name": "Магу кэнки: Бунсин льда (С иконкой)", "type": 1 },
    { "id": "25090401", "name": "Магу кэнки: Бунсин маски (С иконкой)", "type": 1 },
    { "id": "25100101", "name": "Кайраги: Громовое вознесение", "type": 0 },
    { "id": "25100102", "name": "Кайраги: Громовое вознесение", "type": 0 },
    { "id": "25100201", "name": "Кайраги: Огненная мощь", "type": 0 },
    { "id": "25100301", "name": "Кайраги (аура электро)", "type": 0 },
    { "id": "25100302", "name": "Кайраги (аура ... белая?)", "type": 0 },
    { "id": "25100401", "name": "Кайраги (аура пиро)", "type": 0 },
    { "id": "26010101", "name": "Крио попрыгунья", "type": 0 },
    { "id": "26010102", "name": "Крио попрыгунья (Ивент на драконьем хребте)", "type": 0 },
    { "id": "26010103", "name": "Гигантская крио попрыгунья (2.3 Ивент на драконьем хребте)", "type": 1 },
    { "id": "26010104", "name": "Гигантская крио попрыгунья (Особенный...) (2.3 Ивент на драконьем хребте)", "type": 1 },
    { "id": "26010201", "name": "Пиро попрыгунья", "type": 0 },
    { "id": "26010301", "name": "Электро попрыгунья", "type": 0 },
    { "id": "26020101", "name": "Крио папоротник", "type": 1 },
    { "id": "26020102", "name": "Крио папоротник (Ивент на драконьем хребте)", "type": 1 },
    { "id": "26020201", "name": "Пиро орхидея", "type": 1 },
    { "id": "26030101", "name": "Детёныш геовишапа", "type": 0 },
    { "id": "26040101", "name": "Геовишап: Гидро", "type": 0 },
    { "id": "26040102", "name": "Геовишап: Пиро", "type": 0 },
    { "id": "26040103", "name": "Геовишап: Крио", "type": 0 },
    { "id": "26040104", "name": "Геовишап: Электро", "type": 0 },
    { "id": "26040105", "name": "Геовишап: Гидро (Механикус)", "type": 0 },
    { "id": "26050101", "name": "Древний геовишап: Гидро", "type": 1 },
    { "id": "26050201", "name": "Древний геовишап: Пиро", "type": 1 },
    { "id": "26050301", "name": "Древний геовишап: Крио", "type": 1 },
    { "id": "26050401", "name": "Древний геовишап: Электро", "type": 1 },
    { "id": "26050501", "name": "Древний геовишап (Ивент)", "type": 1 },
    { "id": "26050601", "name": "Вишап глубин: Исток", "type": 0 },
    { "id": "26050701", "name": "Вишап глубин: Ледогрыз", "type": 1 },
    { "id": "26050702", "name": "Вишап глубин: Ледогрыз (Особенный...)", "type": 1 },
    { "id": "26050801", "name": "Вишап глубин: Громоглот", "type": 1 },
    { "id": "26050802", "name": "Вишап глубин: Громоглот (Особенный...)", "type": 1 },
    { "id": "26050901", "name": "Вишап глубин: Исток Мини", "type": 0 },
    { "id": "26051001", "name": "Вишап глубин: Ледогрыз Мини", "type": 0 },
    { "id": "26051101", "name": "Вишап глубин: Громоглот Мини", "type": 0 },
    { "id": "26060101", "name": "Электро цицин", "type": 0 },
    { "id": "26060201", "name": "Гидро цицин", "type": 0 },
    { "id": "26060301", "name": "Крио цицин", "type": 0 },
    { "id": "26080101", "name": "Бешт, Отголосок Вихря", "type": 1 },
    { "id": "26090101", "name": "Плавучий плесенник", "type": 0 },
    { "id": "28010101", "name": "Золотистый краб", "type": 1 },
    { "id": "28010102", "name": "Солнечный краб", "type": 1 },
    { "id": "28010103", "name": "Водный краб", "type": 1 },
    { "id": "28010104", "name": "Краб-генерал", "type": 1 },
    { "id": "28010105", "name": "Бледно-красный краб", "type": 1 },
    { "id": "28010106", "name": "Краб", "type": 1 },
    { "id": "28010201", "name": "Синяя рогатая ящерица", "type": 1 },
    { "id": "28010202", "name": "Красная рогатая ящерица", "type": 1 },
    { "id": "28010203", "name": "Зелёная рогатая ящерица", "type": 1 },
    { "id": "28010204", "name": "Закатный аксолотль", "type": 1 },
    { "id": "28010205", "name": "Золотистый аксолотль", "type": 1 },
    { "id": "28010206", "name": "Небесный аксолотль", "type": 1 },
    { "id": "28010207", "name": "Мозгоядный ящер", "type": 1 },
    { "id": "28010301", "name": "Лягушка", "type": 1 },
    { "id": "28010302", "name": "Грязевая лягушка", "type": 1 },
    { "id": "28010303", "name": "Синяя лягушка", "type": 1 },
    { "id": "28010401", "name": "Узорный унаги", "type": 1 },
    { "id": "28010402", "name": "Глубоководный унаги", "type": 1 },
    { "id": "28010403", "name": "Краснопёрый унаги", "type": 1 },
    { "id": "28020101", "name": "Снежная лиса", "type": 0 },
    { "id": "28020102", "name": "Алая лиса", "type": 0 },
    { "id": "28020103", "name": "Снежная лиса с подарками", "type": 0 },
    { "id": "28020104", "name": "Снежная лиса с суперподарками", "type": 0 },
    { "id": "28020105", "name": "Снежная лиса (Особенная...)", "type": 0 },
    { "id": "28020106", "name": "Алая лиса (Особенная...)", "type": 0 },
    { "id": "28020201", "name": "Белка", "type": 0 },
    { "id": "28020301", "name": "Лесной кабан", "type": 0 },
    { "id": "28020302", "name": "Лесной кабанчик", "type": 0 },
    { "id": "28020303", "name": "Снежный кабан", "type": 0 },
    { "id": "28020304", "name": "Король снежных кабанов", "type": 0 },
    { "id": "28020305", "name": "Замороженный снежный кабан", "type": 0 },
    { "id": "28020306", "name": "Снежный кабан (Особенный...)", "type": 0 },
    { "id": "28020307", "name": "Лесной кабан (Особенный...)", "type": 0 },
    { "id": "28020308", "name": "Замороженный снежный кабан (Особенный...)", "type": 0 },
    { "id": "28020309", "name": "Король снежных кабанов (Особенный...)", "type": 0 },
    { "id": "28020401", "name": "Полярная гончая", "type": 0 },
    { "id": "28020402", "name": "Лесная патрульная", "type": 0 },
    { "id": "28020403", "name": "Сиба-ину", "type": 0 },
    { "id": "28020404", "name": "Черноспинная гончая", "type": 0 },
    { "id": "28020405", "name": "Сиба-ину", "type": 0 },
    { "id": "28020406", "name": "Полярная гончая (для события собак, увеличивает дальность обзора)", "type": 0 },
    { "id": "28020407", "name": "null", "type": 0 },
    { "id": "28020408", "name": "null", "type": 0 },
    { "id": "28020409", "name": "null", "type": 0 },
    { "id": "28020410", "name": "null", "type": 0 },
    { "id": "28020501", "name": "Сапфир", "type": 0 },
    { "id": "28020502", "name": "Зеленоглазая кошка", "type": 0 },
    { "id": "28020503", "name": "Снежная кошка", "type": 0 },
    { "id": "28020504", "name": "Полярная кошка", "type": 0 },
    { "id": "28020505", "name": "Тигровая кошка", "type": 0 },
    { "id": "28020506", "name": "Инспекторская кошка", "type": 0 },
    { "id": "28020507", "name": "Чёрная кошка", "type": 0 },
    { "id": "28020508", "name": "Сапфир", "type": 0 },
    { "id": "28020509", "name": "Снежная кошка (для события собак, увеличивает дальность обзора)", "type": 0 },
    { "id": "28020510", "name": "null", "type": 0 },
    { "id": "28020511", "name": "null", "type": 0 },
    { "id": "28020512", "name": "null", "type": 0 },
    { "id": "28020513", "name": "null", "type": 0 },
    { "id": "28020601", "name": "Снежный хорёк", "type": 0 },
    { "id": "28020602", "name": "Краснохвостый хорёк", "type": 0 },
    { "id": "28020603", "name": "Сапожный хорёк", "type": 0 },
    { "id": "28020604", "name": "Маскарадный хорёк", "type": 0 },
    { "id": "28020605", "name": "null", "type": 0 },
    { "id": "28020701", "name": "Кицунэ", "type": 0 },
    { "id": "28020702", "name": "Кицунэ (для события собак, увеличивает дальность обзора)", "type": 0 },
    { "id": "28020801", "name": "Бакэ-дануки", "type": 0 },
    { "id": "28020802", "name": "null", "type": 0 },
    { "id": "28020803", "name": "null", "type": 0 },
    { "id": "28020901", "name": "Пёс-самурай (Патруль)", "type": 0 },
    { "id": "28020902", "name": "Пёс-самурай (Бой)", "type": 0 },
    { "id": "28020903", "name": "null", "type": 0 },
    { "id": "28030101", "name": "Лазурный журавль", "type": 0 },
    { "id": "28030102", "name": "Фиолетовый ибис", "type": 0 },
    { "id": "28030201", "name": "Бурокрылый сокол", "type": 0 },
    { "id": "28030202", "name": "Янтарнохвостый сокол", "type": 0 },
    { "id": "28030203", "name": "Каменный коршун", "type": 0 },
    { "id": "28030204", "name": "Белоснежный сокол", "type": 0 },
    { "id": "28030301", "name": "Белый голубь", "type": 0 },
    { "id": "28030302", "name": "Коронованный голубь", "type": 0 },
    { "id": "28030303", "name": "Среброкрылый голубь", "type": 0 },
    { "id": "28030304", "name": "Багровый голубь", "type": 0 },
    { "id": "28030305", "name": "Чёрный голубь", "type": 0 },
    { "id": "28030306", "name": "Ворон", "type": 0 },
    { "id": "28030307", "name": "Белый голубь", "type": 0 },
    { "id": "28030308", "name": "Коронованный голубь", "type": 0 },
    { "id": "28030309", "name": "Среброкрылый голубь", "type": 0 },
    { "id": "28030310", "name": "Багровый голубь", "type": 0 },
    { "id": "28030311", "name": "Чёрный королевский голубь", "type": 0 },
    { "id": "28030401", "name": "Алый зяблик", "type": 0 },
    { "id": "28030402", "name": "Золотой зяблик", "type": 0 },
    { "id": "28030403", "name": "Снежный зяблик", "type": 0 },
    { "id": "28030404", "name": "Изумрудный зяблик", "type": 0 },
    { "id": "28030405", "name": "null", "type": 0 },
    { "id": "28030406", "name": "null", "type": 0 },
    { "id": "28030407", "name": "null", "type": 0 },
    { "id": "28030408", "name": "null", "type": 0 },
    { "id": "28030409", "name": "null", "type": 0 },
    { "id": "28030501", "name": "Красноклювая утка", "type": 0 },
    { "id": "28030502", "name": "Изумрудная утка", "type": 0 },
    { "id": "28030503", "name": "Золотая утка", "type": 0 },
    { "id": "28030504", "name": "null", "type": 0 },
    { "id": "28040101", "name": "Чёрный окунь", "type": 1 },
    { "id": "28040102", "name": "Голубой окунь", "type": 1 },
    { "id": "28040103", "name": "Золотистый окунь", "type": 1 },
    { "id": "28040104", "name": "Чёрный окунь", "type": 1 },
    { "id": "28040105", "name": "Чёрный окунь", "type": 1 },
    { "id": "28040106", "name": "Голубой окунь", "type": 1 },
    { "id": "28040107", "name": "Золотистый окунь", "type": 1 },
    { "id": "28040108", "name": "null", "type": 1 },
    { "id": "28040201", "name": "Оризия", "type": 1 },
    { "id": "28040202", "name": "Глазурная оризия", "type": 1 },
    { "id": "28040203", "name": "Сахарная оризия", "type": 1 },
    { "id": "28040204", "name": "Голубая оризия", "type": 1 },
    { "id": "28040205", "name": "Ловец зари", "type": 1 },
    { "id": "28040206", "name": "Кристальная рыба", "type": 1 },
    { "id": "28040301", "name": "Двоякодышащая колюшка", "type": 1 },
    { "id": "28040302", "name": "Боевая колюшка", "type": 1 },
    { "id": "28040303", "name": "Ядовитая колюшка", "type": 1 },
    { "id": "28040304", "name": "Алый дьявол", "type": 1 },
    { "id": "28040305", "name": "Снежный странник", "type": 1 },
    { "id": "28040401", "name": "Золотой лжедракон", "type": 1 },
    { "id": "28040402", "name": "Стальной лжедракон", "type": 1 },
    { "id": "28040501", "name": "Бурая рыба-бабочка", "type": 1 },
    { "id": "28040502", "name": "Пурпурная рыба-бабочка", "type": 1 },
    { "id": "28040503", "name": "Чайная рыба-бабочка", "type": 1 },
    { "id": "28040504", "name": "Вечная рыба-ангел", "type": 1 },
    { "id": "28040505", "name": "Рыба-ангел раймэй", "type": 1 },
    { "id": "28040506", "name": "Луннопёрка", "type": 1 },
    { "id": "28040601", "name": "Иглобрюх", "type": 1 },
    { "id": "28040602", "name": "Горький иглобрюх", "type": 1 },
    { "id": "28040701", "name": "null", "type": 1 },
    { "id": "28040702", "name": "null", "type": 1 },
    { "id": "28040703", "name": "null", "type": 0 },
    { "id": "28050101", "name": "Кристальная бабочка Анемо", "type": 1 },
    { "id": "28050102", "name": "Кристальная бабочка Гео", "type": 1 },
    { "id": "28050103", "name": "Кристальная бабочка Крио", "type": 1 },
    { "id": "28050104", "name": "Кристальная бабочка Электро", "type": 1 },
    { "id": "28050105", "name": "null", "type": 1 },
    { "id": "28050201", "name": "Хорёк-воришка", "type": 0 },
    { "id": "28050202", "name": "Хорёк-барахольщик", "type": 0 },
    { "id": "28050203", "name": "Золотой хорёк-воришка", "type": 0 },
    { "id": "28050204", "name": "null", "type": 0 },
    { "id": "28050211", "name": "Хорёк-воришка", "type": 0 },
    { "id": "28050212", "name": "Хорёк-барахольщик", "type": 0 },
    { "id": "28050213", "name": "Золотой хорёк-воришка", "type": 0 },
    { "id": "28050221", "name": "null", "type": 0 },
    { "id": "28050222", "name": "null", "type": 0 },
    { "id": "28050223", "name": "null", "type": 0 },
    { "id": "28050301", "name": "null", "type": 1 },
    { "id": "28210101", "name": "Домашний золотистый краб", "type": 0 },
    { "id": "28210102", "name": "Домашний солнечный краб", "type": 0 },
    { "id": "28210103", "name": "Домашний водный краб", "type": 0 },
    { "id": "28210104", "name": "Домашний краб-генерал", "type": 0 },
    { "id": "28210105", "name": "Домашний бледно-красный краб", "type": 0 },
    { "id": "28210201", "name": "Домашний синяя рогатая ящерица", "type": 0 },
    { "id": "28210202", "name": "Домашний красная рогатая ящерица", "type": 0 },
    { "id": "28210203", "name": "Домашний зелёная рогатая ящерица", "type": 0 },
    { "id": "28210204", "name": "Домашний закатный аксолотль", "type": 0 },
    { "id": "28210205", "name": "Домашний золотистый аксолотль", "type": 0 },
    { "id": "28210206", "name": "Домашний небесный аксолотль", "type": 0 },
    { "id": "28210207", "name": "Домашний мозгоядный ящер", "type": 0 },
    { "id": "28210301", "name": "Домашний лягушка", "type": 0 },
    { "id": "28210302", "name": "Домашний грязевая лягушка", "type": 0 },
    { "id": "28210303", "name": "Домашний синяя лягушка", "type": 0 },
    { "id": "28210401", "name": "Домашний узорный унаги", "type": 0 },
    { "id": "28210402", "name": "null", "type": 0 },
    { "id": "28210403", "name": "Домашний краснопёрый унаги", "type": 0 },
    { "id": "28220101", "name": "Домашний снежная лиса", "type": 0 },
    { "id": "28220102", "name": "Домашний алая лиса", "type": 0 },
    { "id": "28220201", "name": "Домашний белка", "type": 0 },
    { "id": "28220301", "name": "Домашний лесной кабан", "type": 0 },
    { "id": "28220303", "name": "Домашний снежный кабан", "type": 0 },
    { "id": "28220401", "name": "Домашний полярная гончая", "type": 0 },
    { "id": "28220402", "name": "Домашний лесная патрульная гончая", "type": 0 },
    { "id": "28220403", "name": "Домашний сиба-ину", "type": 0 },
    { "id": "28220404", "name": "Домашний черноспинная гончая", "type": 0 },
    { "id": "28220501", "name": "Домашний сапфир", "type": 0 },
    { "id": "28220502", "name": "Домашний зеленоглазая кошка", "type": 0 },
    { "id": "28220503", "name": "Домашний снежная кошка", "type": 0 },
    { "id": "28220504", "name": "Домашний полярная кошка", "type": 0 },
    { "id": "28220505", "name": "Домашний тигровая кошка", "type": 0 },
    { "id": "28220506", "name": "Домашний инспекторская кошка", "type": 0 },
    { "id": "28220601", "name": "Домашний снежный хорёк", "type": 0 },
    { "id": "28220602", "name": "Домашний краснохвостый хорёк", "type": 0 },
    { "id": "28220603", "name": "Домашний сапожный хорёк", "type": 0 },
    { "id": "28220605", "name": "null", "type": 0 },
    { "id": "28220701", "name": "Домашний кицунэ", "type": 0 },
    { "id": "28220901", "name": "Домашний пёс-самурай", "type": 0 },
    { "id": "28230101", "name": "Домашний лазурный журавль", "type": 0 },
    { "id": "28230102", "name": "Домашний фиолетовый ибис", "type": 0 },
    { "id": "28230301", "name": "Домашний белый голубь", "type": 0 },
    { "id": "28230302", "name": "Домашний коронованный голубь", "type": 0 },
    { "id": "28230303", "name": "Домашний среброкрылый голубь", "type": 0 },
    { "id": "28230304", "name": "Домашний багровый голубь", "type": 0 },
    { "id": "28230305", "name": "Домашний чёрный королевский голубь", "type": 0 },
    { "id": "28230306", "name": "Домашний ворон", "type": 0 },
    { "id": "28230401", "name": "Домашний алый зяблик", "type": 0 },
    { "id": "28230402", "name": "Домашний золотой зяблик", "type": 0 },
    { "id": "28230403", "name": "Домашний снежный зяблик", "type": 0 },
    { "id": "28230404", "name": "Домашний изумрудный зяблик", "type": 0 },
    { "id": "28240201", "name": "Домашний оризия", "type": 0 },
    { "id": "28240202", "name": "Домашний глазурная оризия", "type": 0 },
    { "id": "28240203", "name": "Домашний сахарная оризия", "type": 0 },
    { "id": "28240204", "name": "Домашний голубая оризия", "type": 0 },
    { "id": "28240205", "name": "Домашний ловец зари", "type": 0 },
    { "id": "28240206", "name": "Домашний кристальная рыба", "type": 0 },
    { "id": "28240301", "name": "Домашний двоякодышащая колюшка", "type": 0 },
    { "id": "28240302", "name": "Домашний боевая колюшка", "type": 0 },
    { "id": "28240303", "name": "Домашний ядовитая колюшка", "type": 0 },
    { "id": "28240304", "name": "Домашний алый дьявол", "type": 0 },
    { "id": "28240305", "name": "Домашний снежный странник", "type": 0 },
    { "id": "28240401", "name": "Домашний золотой лжедракон", "type": 0 },
    { "id": "28240402", "name": "Домашний стальной лжедракон", "type": 0 },
    { "id": "28240501", "name": "Домашний бурая рыба-бабочка", "type": 0 },
    { "id": "28240502", "name": "Домашний пурпурная рыба-бабочка", "type": 0 },
    { "id": "28240503", "name": "Домашний чайная рыба-бабочка", "type": 0 },
    { "id": "28240504", "name": "Домашний рыба-ангел тёсэи", "type": 0 },
    { "id": "28240505", "name": "Домашний рыба-ангел раймэи", "type": 0 },
    { "id": "28240506", "name": "Домашний луннопёрка", "type": 0 },
    { "id": "28240601", "name": "Домашний иглобрюх", "type": 0 },
    { "id": "28240602", "name": "Домашний горький иглобрюх", "type": 0 },
    { "id": "28240701", "name": "null", "type": 0 },
    { "id": "28240702", "name": "null", "type": 0 },
    { "id": "28250101", "name": "Домашний кристальная бабочка Анемо", "type": 0 },
    { "id": "28250102", "name": "Домашний кристальная бабочка Гео", "type": 0 },
    { "id": "28250103", "name": "Домашний кристальная бабочка Крио", "type": 0 },
    { "id": "28250104", "name": "Домашний кристальная бабочка Электро", "type": 0 },
    { "id": "28250105", "name": "null", "type": 0 },
    { "id": "28250301", "name": "null", "type": 0 },
    { "id": "29010101", "name": "Двалин, Ужас бури", "type": 1 },
    { "id": "29010102", "name": "Двалин, Ужас бури", "type": 1 },
    { "id": "29010103", "name": "Ужас бури", "type": 1 },
    { "id": "29010104", "name": "Двалин, Ужас бури", "type": 1 },
    { "id": "29020101", "name": "Волк Севера. Борей", "type": 1 },
    { "id": "29020102", "name": "Андриус, Волчий лорд", "type": 1 },
    { "id": "29030101", "name": "Чайльд, номер одиннадцать из Предвестников Фатуи", "type": 1 },
    { "id": "29030102", "name": "Чайльд, Глаз Порчи", "type": 1 },
    { "id": "29030103", "name": "Чайльд", "type": 1 },
    { "id": "29030104", "name": "Чайльд, номер одиннадцать из Предвестников Фатуи", "type": 1 },
    { "id": "29030105", "name": "Чайльд, Глаз Порчи", "type": 1 },
    { "id": "29030106", "name": "Чайльд", "type": 1 },
    { "id": "29040101", "name": "Аждаха", "type": 1 },
    { "id": "29040102", "name": "Аждаха", "type": 1 },
    { "id": "29040103", "name": "Аждаха", "type": 1 },
    { "id": "29040104", "name": "Аждаха", "type": 1 },
    { "id": "29040111", "name": "Аждаха", "type": 1 },
    { "id": "29050101", "name": "Синьора", "type": 1 },
    { "id": "29050102", "name": "Тлеющая алая ведьма", "type": 1 },
    { "id": "29050103", "name": "Синьора", "type": 1 },
    { "id": "29050104", "name": "Тлеющая алая ведьма", "type": 1 },
    { "id": "29060101", "name": "Cёгун Райдэн", "type": 1 },
    { "id": "29060102", "name": "Райдэн Эи", "type": 1 },
    { "id": "29060201", "name": "null", "type": 1 },
    { "id": "29060202", "name": "null", "type": 1 },
    { "id": "29060203", "name": "null", "type": 1 }
]